[
    {"url": "https://www.allrecipes.com/recipe/189576/chicken-meatballs-and-spaghetti/", "category": ["Chicken", "Spaghetti"], "title": "Chicken Meatballs and Spaghetti", "description": "Chicken meatballs are simmered in a homemade tomato sauce and served with spaghetti noodles.", "ingredients": ["1 (16 ounce) can crushed tomatoes", "1 (8 ounce) can diced tomatoes", "3 (6 ounce) cans tomato paste", "2.25 cups water", "1 tablespoon dried basil", "salt and pepper, to taste", "2 pounds ground chicken", "1 cup dry bread crumbs", "0.5 cup grated Parmesan cheese", "2 eggs, lightly beaten", "2 tablespoons Italian seasoning", "salt and pepper, to taste", "cooking spray", "1 (16 ounce) package whole-wheat spaghetti"], "instructions": [{"type": "HowToStep", "text": "Stir together the crushed tomatoes, diced tomatoes, tomato paste, water, and basil in a large saucepan over medium heat. Salt and pepper to taste. Bring to a boil, reduce heat to low, and simmer for 15 minutes while preparing meatballs.", "image": null}, {"type": "HowToStep", "text": "Mix together the ground chicken, bread crumbs, Parmesan cheese, eggs, Italian seasoning, salt, and pepper in a medium bowl. Roll into 1 inch balls. Heat a large skillet over medium heat, and coat with cooking spray. Brown the meatballs on all sides. Add meatballs to the simmering pasta sauce and cook until internal temperature of meatballs reaches a minimum of 160 degrees F (72 degrees C), about 30 minutes.", "image": null}, {"type": "HowToStep", "text": "Fill a large pot with lightly salted water, and bring to a rolling boil over high heat. Once the water is boiling, stir in the spaghetti, and return to a boil. Cook until the pasta has cooked through, but is still firm to the bite, about 12 minutes. Drain. Serve the meatballs and sauce over the cooked spaghetti.", "image": [{"type": "ImageObject", "url": "https://www.allrecipes.com/thmb/L7e7_mPLBrE_kQwGi1kRFmicnHU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8162424-3c00617e842e45a18d0c9643d6ef6ad5.jpg"}]}], "image": {"type": "ImageObject", "url": "https://www.allrecipes.com/thmb/L7e7_mPLBrE_kQwGi1kRFmicnHU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/8162424-3c00617e842e45a18d0c9643d6ef6ad5.jpg", "height": 960, "width": 960}, "video": {"type": "VideoObject", "embed_url": "https://players.brightcove.net/1033249144001/default_default/index.html?videoId=1092928712001", "description": "What's cooking in Chicago? Kim's healthy chicken meatballs and spaghetti.", "duration": "PT4M55S", "name": "What’s Cooking in Chicago, IL?", "thumbnail_url": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/1033249144001/593b33cb-3aa4-4771-8cee-2b5699e1f231/f594429e-a27d-4a87-967c-7d7fc854a101/1280x720/match/image.jpg", "upload_date": "2021-07-29 18:12:33"}, "datePublished": "2019-04-03 23:47:25", "servings": 8, "cookTime": "PT45M", "prepTime": "PT20M", "reviews": [{"name": "Cassie", "rating": 5, "body": "I like things that are easy to make, and this fit the bill. I did make a couple changes. I used a little less Italian seasoning, and added a lot of fresh chopped Italian parsley."}, {"name": "Ms. Chef Esh", "rating": 5, "body": "If you like Chicken Parmesan as much as I do, you will love this recipe! I added in some fresh chopped garlic to the sauce. Outstanding recipe!"}, {"name": "JLO54", "rating": 5, "body": "These meatballs were delicious! Of course I tweaked the recipe a little only because I've made chicken meatballs before, and I know they can be bland. I used seasoned bread crumbs but stilled used the full amount of Italian seasoning. I added a little fennel powder/onion powder/ground sage. I also added some crushed garlic. I just used a jarred sauce to which I added some mushrooms which I sauteed in the fry pan after frying the meatballs. I usually bake my meatballs, but I fried them this time in some olive oil and canola oil. Oh...I also heated up the sauce with the leftover rind of some Parmigiana Reggiano cheese which I had in the freezer. I rarely use a recipe exactly as it is displayed...unless I'm baking a cake or something like that. This is a keeper!"}, {"name": "BLUEGIRL5", "rating": 5, "body": "I am reviewing only the meatballs, as I used my own sauce recipe. These chicken meatballs were delicious! Perfect texture, quite flavorful (I doubled the cheese and used freshly grated Romano), and incredibly easy. And so much healthier than using beef. A keeper!"}, {"name": "abbyz2000", "rating": 4, "body": "Five stars for the meatballs and 3 for the sauce. Sauce was too tomatoe-y even after I added bell peppers and garlic."}, {"name": "azara", "rating": 3, "body": "The pasta sauce had too strong of a tomato taste for me. If I make this recipe again I’ll use just one can of tomato paste instead of three. I’ll also start off with fresh diced onion sautéed in a bit of olive oil before putting the tomatoes in the pot. I’d also most likely used some parsley as well as the basil to offset the tomato flavor."}, {"name": "3boyskitchen", "rating": 5, "body": "This was amazingly easy to make. It turned out excellent as written."}, {"name": "Cheryl Allumi", "rating": 5, "body": "Great recipe! I doubled the recipe and used them in spaghetti and a white chicken chili recipe. The meatballs were very flavorful."}, {"name": "Kim Tally Kingsfield", "rating": 5, "body": "The meatballs were great and I liked the ingredients just as they are given. I didn't have the ingredients for the sauce, so I had to use a jar sauce. It was good this way too, but next time I will try to make the sauce from scratch."}, {"name": "christine", "rating": 4, "body": "I will make again. A good way to use ground chicken."}, {"name": "Bruzebra", "rating": 5, "body": "I didn't make the sauce, but I had 2 lbs of ground chicken that was defrosted and had to be used. These were really good, we used them as dinner sides and snacks. Will make again with the sauce."}, {"name": "Melanie Dorminey", "rating": 5, "body": "Easy and delicious! I use Rao's Homemade jar sauce, bake the meatballs and add some Parmesan. Love it!"}, {"name": "adeal", "rating": 5, "body": "i used a cream sauce with mushrooms instead of red sauce..meatballs were moist and delicious"}, {"name": "nicolehh", "rating": 4, "body": "I made the meatballs according the recipe, then cooked them in a jarred sauce to speed things up a little. The meatballs were delicious! I'll definitely make them again."}, {"name": "mia", "rating": 5, "body": "I added sundries tomatoes to it!! Just chopped fresh ones not the oiled packed from jar... Turned out delicious and I didn't make the sauce I prefer no sauce or I make my grandmas recipe sauce... Delicious ..."}, {"name": "bbreagan", "rating": 5, "body": "I only used the recipe for the chicken meatballs - fabulous!"}, {"name": "Melvista5", "rating": 5, "body": "I love these meatballs hot or cold, alone or with pasta or bread. They don't make me think I'm eating chicken, just a tasty meatball. The kids really enjoy them so I make a lot for the kids to grab anytime."}, {"name": "Lori", "rating": 4, "body": "Loved the meatballs, but I prefer another sauce recipe over this one. Great weeknight meal! I baked the meatballs at 375 for 15 - 20 minutes instead of frying in skillet. Will make again."}, {"name": "carol_nieanaber", "rating": 5, "body": "This is a great recipe as is! I'm always looking for healthy low fat versions of our favorite recipes and this is a winner. My daughter is very picky but absolutely loves these meatballs. She also loved helping me measure and mix the ingredients. It's a very kid friendly and yummy recipe."}, {"name": "Cray", "rating": 5, "body": "I love these chicken meatballs. My family actually likes these better than meatballs made with ground beef. I make the recipe exactly as written for the meatballs (I make my own sauce)."}, {"name": "Cheryl", "rating": 5, "body": "This was excellent. I made it with wheat pasta &amp; will defiantly make it part of my bi-weekly pasta dish."}, {"name": "Lisa ", "rating": 5, "body": "I made the chicken meatballs for the first time 10-12-13 and they were so delicious! They had such a different taste than beef meatballs. I had my own sauce but will make the entire recipe next time. Definitely a keeper!"}, {"name": "Cindy", "rating": 4, "body": "Very moist and delicious. I made a few changes. I 1/2 the recipe &amp; baked it for 10 min then let them simmer in a jar of Barrilla Marinara for 20 min. Next time I'll cut back on Italian seasoning &amp; add garlic"}, {"name": "scubagirl", "rating": 4, "body": "The meatballs, themselves, deserve 5 stars, but the sauce was bland. I sauteed onions, mushrooms, and garlic to add, but it was missing some spices. I was hoping cooking the meatballs in the sauce would be enough to add some flavor, but it wasn't. Next time, I will up the spice in the sauce, maybe add a touch of brown sugar, wine, Italian seasoning, more garlic, etc. I will make this recipe again, though...the meatballs were great."}, {"name": "aratcliff77", "rating": 4, "body": "Great recipe! My 11 month old loved it. The only thing I would do different is add more flavor to the sauce. I added garlic salt and some onion powder."}, {"name": "shale", "rating": 5, "body": "Wow!! Who knew I could make meatballs?? I used pre-seasoned panko instead of bread crumbs and skipped the parmesan cheese, and they turned out great. The only tricky part was browning the meatballs because I couldn't figure out how to brown them \"on all sides\". I ended up squashing them a little bit in order to keep turning them and ended up with little 3-D hexagons. That part was tricky but they really ended up delicious. Used sauce from a jar and whole-wheat spaghetti. What a great recipe, perfect even for someone who has no clue what they're doing."}, {"name": "SLJ6", "rating": 5, "body": "Yum!....Love using extra lean ground chicken instead of beef. A few mini changes....I only used 1 lb of ground chicken and I added 2 large cloves of garlic finely minced to the meatball mixture and added pecorino romano cheese and whole wheat Italian style bread crumbs in addition to the egg and seasonings. I also baked my meatballs instead of pan frying which saves fat and calories. Added some dry red wine to the sauce as well. Nice dinner...thanks!"}, {"name": "Vikki Cabral", "rating": 5, "body": "I made the meatballs exactly as the recipe is written and used good sauce that I already had. We made toasted chicken meatballs subs with melted mozzarella cheese. Loved it. Will definitely make again."}, {"name": "DIZ&#9829;", "rating": 3, "body": "I'm torn with this recipe. The meatballs are excellent! I'm starting to cook more with ground chicken and I'm really liking it. Unfortunately, the sauce brings this recipe down. Even with all of the basil, it still tastes like plain tomato sauce from a can. By the time I finished doctoring it up, it beared no resemblance to the recipe."}, {"name": "Shannon Vetere", "rating": 5, "body": "I cheated and used 2 jars of sauce to save time after work. These meatballs are so simple, but so delicious. I have made them three times now and each time my husband and I talk about how good they are during the entire meal. I can't get enough of them :)"}, {"name": "kris", "rating": 4, "body": "Have made several times and will make again!"}, {"name": "Wen-dee", "rating": 3, "body": "Meatball portion of recipe was great. Sauce needs a lot of other ingredients including onions, garlic, peppers (any colour), oregano and I like mushrooms in my sauce too. I usually add a pinch of brown sugar too...removes the acid from the tomatoes."}, {"name": "Julie Strablizky Wright", "rating": 5, "body": "I use ground turkey and up the italian seasonings, garlic, and parm cheese. A high quality parmesan is a must. I test fry a mini meatball before cooking and add seasoning accordingly before shaping the balls. I bake in a 375 oven for about 30 minutes, easier than panfrying. The sauce recipe is great too, although i tweak it. I saute some onions and garlic in basil olive oil before adding canned tomatoes ( i usually buy the garlic and oregano seasoned, the more flavor the better!) and add more seasoning (I use a spicy italian herb grinder) and red pepper flakes (we like it spicy!). I let it simmer for a long time (an hour or so) to let the flavors meld. So good, we make this about once a week, and any leftovers are even better the next day!"}, {"name": "nvolvedmom", "rating": 2, "body": "Didn't care for. It was easy, but so is my homemade sauce."}, {"name": "Jillinois!", "rating": 5, "body": "Used this just for the meatball recipe, which I cut in half and simmered in pre-made pasta sauce. These were great meatballs!"}, {"name": "Laura", "rating": 5, "body": "Absolutly Beautiful. I loved the chicken for a change, intead of beef. It was full of Flavour and the Husband loved it also, and he's very fussy. I also added a half a teaspoon of chilli powder to the meatball mix just to give it that little spicy kick."}, {"name": "leafsgal1976", "rating": 4, "body": "I only made the meatballs and my picky daughter actually ate every last bite!!! I was in a rush so just used a pre-made pasta sauce and added a can of diced italian tomatoes. My husband enjoyed it as well... I will definitely make them again."}, {"name": "CPECINICH", "rating": 5, "body": "Smells awesome - haven't tried it yet but the kids love it - that's enough in my book with two picky eaters!"}, {"name": "gbv239", "rating": 4, "body": "I just made the meatballs with ground beef and used jar pasta sauce it turned out great."}, {"name": "HoneybeesMommy", "rating": 2, "body": "Beyond bland. I hadn't realized until after I cooked it that there's barely any seasoning. The texture reminds me of canned tomato sauce, not even jarred. As to the meatballs, they were very good except that they were dry. They needed to be covered with at least a little sauce and since the sauce I made them with was gross, the meatballs weren't as good as they should have been. I gave the recipe 2 stars because I fully intend on making the meatballs again with a different sauce. The meatballs alone deserve a 3.5 star rating. My kids though did not like them as much as I did. My kids tend to like simple taste combinations and this recipe had too much italian seasoning for THEIR tastes. As an adult, I thought it was a good combo."}, {"name": "ashleaf", "rating": 4, "body": "The meatball part of the recipe was great (although I used ground Italian turkey instead of chicken)... I make a similar sauce that I've perfected over time, and will likely continue to use in the future, but this sauce was pretty good too. For a thicker sauce try adding a little less water or more tomato sauce. Also I hadn't tried using whole-wheat pasta before and actually really enjoyed it (not to mention the health benefits)."}, {"name": "rmrivera67", "rating": 5, "body": "My daughter and I really enjoyed this recipe. I did take the suggestion of one user and used San Marzano Tomato Sauce and it really was delicious! This will definitely go in my family dinner file and be used quite often!"}, {"name": "Wendy Douglass", "rating": 5, "body": "The grocery store that I went to didn't have any ground chicken, so I got ground turkey. Turned out great! I didn't throw all the meatballs into my sauce, only what I wanted to eat and froze the rest for future use. I also baked my meatballs because it was less mess and less time consuming."}, {"name": "LaDiva Smith Drew", "rating": 5, "body": "I loved this recipe! Easy prep and the family enjoyed it so much that second helpings were a must. I did substitute turkey for the chicken and used dried oats instead of bread crumbs to increase the fiber. I am sharing with all of my cooking buddies...."}, {"name": "pixie", "rating": 4, "body": "The meatballs are delicious!"}, {"name": "Colleen", "rating": 4, "body": "We'd give the meatballs a 4. The only change was that I added a dash of garlic powder. We'd give the sauce a 3. It was a little too watery for us, and I only used 2 cups of water. I added 3 garlic cloves that I browned in olive oil and I used fresh tomatoes instead of canned."}, {"name": "jeidipippins", "rating": 5, "body": "I followed the recipe as closely as I could w what I had at home. I had to use 1 lb of turkey and alb of lean ground beef. My diced tomatoes were chili spiced. My husband and son loved it! This is a keeper! Thanks!"}, {"name": "BusySpoons", "rating": 5, "body": "Inspired by CookingDiva Kim's fun espisode of What's Cooking on Allrecipes tv, I made this for my family last night--rave reviews &amp; clean plates from kids &amp; adults alike! I had no idea that meatballs were that easy to make--and I loved using ground Chicken is a healthier alternative to beef or sausage. My only modification is that I cut the Italian seasoning to 1 Tbs (but Kim is RIGHT, Chicken needs more spices than sausage would) and added some fresh minced garlic and about 1/2 Tsp of sea salt to the meatball mixture. Also, I highly recommend looking for San Marzano canned tomatoes &amp; paste when you make this. San Marzano canned tomatoes have a bright flavor gives the sauce a vine-ripened taste out of the can. Try them, and you'll never go back to regular tomatoes for your spaghetti and pizza sauces. Great recipe--thanks CookingDiva!"}, {"name": "*Sherri*", "rating": 4, "body": "My rating is also just for the meatballs...I have my own sauce recipe. I followed the meatball recipe just as written...first let me say this makes alot of meatballs, you may want to cut the recipe in half for less than four people. I did bake mine in the oven for twenty minutes at 350, easier and healthier. You can find ground chicken at Walmarts. I topped the spaghetti with fresh parmesean cheese and clilantro. The whole family raved about this...and they knew it was chicken and not red meatballs."}, {"name": "Jen", "rating": 5, "body": "This rating is only for the meatballs as I didn't make the sauce. The meatballs are delicious! I have found great recipes for turkey meatballs, but I have a hard time finding ground turkey, so this recipe is great. Great flavour."}, {"name": "Arneatia1", "rating": 2, "body": "This recipe was very bland. My boyfriend enjoyed it. Will probably make again on the strength of him, but will use a lot more seasonings."}, {"name": "jesslynn", "rating": 5, "body": "I just made the meatballs, since I had homemade sauce in the freezer, and they were delicious! Tender, flavorful, juicy. I did use turkey instead of chicken, and a little less Italian seasoning than the recipe called for, plus I added a little onion and garlic powder. They are very tasty! Will make it again!"}, {"name": "slyoung46", "rating": 5, "body": "Great recipe! I made turkey meatballs because I couldn't find chicken, I added more seasoning to the meatballs and sauce, and I added onions and garlic to the sauce. Made it even better!"}, {"name": "takisha", "rating": 5, "body": "I only made the meatballs. They were very good. All i needed was to add a lil extra salt to make it perfect."}, {"name": "Beth", "rating": 5, "body": "6/1/2010 we all liked it. i used ground turkey, 1 lb so i halved the meatball part of it. I kept the sauce the same except i didn't have 3 cans of paste. I used 1 can and 3/4 cup of water. Also fresh parsley and basil, garlic powder and celery salt. a little acidic so i added some brown sugar, still acidic so i added a little half and half, that helped alot. Also, i baked the meatballs at 350 for half hour and then put into sauce on low for 1 1/2 hours. tasty.\n6/11 this time i put a little mozz cheese in the middle of the meatballs, matthew really liked it."}, {"name": "dropsofjupiter", "rating": 5, "body": "first of all, I just want to say sorry that I somewhat changed the recipe because I didn't have enough ground chicken breast to make meatballs, and I had originally set out to make spaghetti and meat sauce. I followed the recipe ingredients for the sauce, first frying the chicken, then adding tomatoes and tomato paste and water. added spices, some celery salt and garlic powder, oregano and basil, pretty much the same as I make my own sauce but also added 1 tablespoon of vinegar and a little brown sugar to cut the strong tomato flavour a little. Let it simmer and dinner was ready within an hour! My sons loved it, even my picky 5 year old!! Now that I have found this recipe, (added to my favorites) I will make the chicken meatballs next time...they sound really yummy!"}, {"name": "Amber", "rating": 5, "body": "I just made the meatballs, wonderful goodness!"}, {"name": "michelle", "rating": 5, "body": "I made my own sauce and added onions to ground chicken mixture and loved it!"}, {"name": "argove", "rating": 4, "body": "I used super lean ground turkey for my meatballs. I would try to use chicken if i made this again. I would also cut the tomato paste down to 1 or 2 cans at the most. Very low cal compared to my homemade meatballs."}, {"name": "Pauline", "rating": 5, "body": "Yummo! I just made the meatballs b/c my kids don't like sauce, so I baked them. Don't think that matters. The meatballs were delish!"}, {"name": "Kate", "rating": 5, "body": "I've tried making sauce before and they all turned out terribly. I followed the directions for this sauce and then added maybe a tablespoon of sugar at the end, it was fantastic!! My husband loved the meatballs too. I don't think he even knew they were made from turkey instead of beef!! Thanks for the recipe!"}, {"name": "Sam", "rating": 3, "body": "I think this dish was pretty mediocre. Then again, I rushed the dish a bit and didn't let the meatballs sit in the sauce very long. I'll try again some other time when I'm not trying to cook as quickly as possible due to extreme hunger."}, {"name": "prgr2007", "rating": 5, "body": "This was really good! The sauce was very light and enjoyable. I used the ground chicken in the meatballs and they were fantastic! I did bake them on 350 for about 20 minutes, per the suggestion of another reviewer. I prefer this to browning them in a skillet because it's easier. =) The chicken made such nice meatballs. They were very filling and much better than beef meatballs! \n\nThe only change I have made (after making this several times, it's such a hit!) was adding sauteed onion, green pepper, and garlic, and putting more seasoning in the sauce. A+!"}, {"name": "foodinmybelly", "rating": 5, "body": "I only used 1 T of the Italian seasoning for the meatballs, and added a bit of oregano to the sauce. The meatballs were great, next time I may double the sauce and use for meatball subs. Thank you for the recipe :)"}, {"name": "JENNKENN", "rating": 4, "body": "Great recipe! All who ate it loved it. I thought the sauce could have used more diced tomatoes. Also I couldn't find chicken so I used turkey. And I used Italian seasoned breadcrumbs and some Tomato Pesto seasoning instead of the Italian seasoning. Next time I'll use more diced tomatoes. A keeper and will definitely make this one again!"}, {"name": "Cruz", "rating": 5, "body": "This dish was terrific. My 3yr old daughter had the best time making the meatballs (we used ground turkey). And the bonus was she loved the food."}, {"name": "Tara Para", "rating": 5, "body": "I loved this recipe. My husband is Italian but gets really bad heartburn from red sauces so he was reluctant to eat this at first, but it didn't give him any heartburn (I did add about 1/4 milk and 1 tbsp. sugar to lessen the acidity). Even my sister who hates pasta and Italian food is asking me on a regular basis to invite her oven again for this dish! The chicken meatballs are amazing...it's like chicken parmesan but in meatball form...so yummy! I prefer this over beef meatballs any day!"}, {"name": "Traci-in-Cali", "rating": 4, "body": "Mmmm really good; I used ground turkey instead of chicken and cut the seasoning back a bit. I always roll my meatballs and then bake them on a baking sheet before adding them to the sauce. 350 oven for about 25 min. I used regular instead of whole wheat spaghetti; everyone really liked this spaghetti dinner. I didn't tell them it was turkey either!"}, {"name": "Shannon", "rating": 5, "body": "I had sauce already prepared, so I only used the meatball portion of this recipe, and it was excellent! I used Ritz crackers instead of bread crumbs, and ground turkey instead of ground chicken. They turned out really well and everyone loved them!"}, {"name": "Susane", "rating": 4, "body": "This recipe proves that you can have healthy and tasty at the same time. I ground my own chicken for the meatballs and froze half of them for later use."}, {"name": "tara7727", "rating": 4, "body": "I thought that it was very good the only trouble I had was finding ground chicken at my grocery store. Intead I used ground turkey which was surprisingly good and no one noticed the difference in the sauce but I would like to try it with the chicken."}, {"name": "milt", "rating": 5, "body": "omg!!!!!! this is one awsome recipe...i recomend it to anyone...it is so good"}, {"name": "Kelly", "rating": 4, "body": "Absolutely fantastic! I am no a cook nor into cooking - just want to make healthy meals my family will eat. I only made the meatballs and used ground turkey rather than chicken simply because that's what I had on hand. I also used Extra Virgin Olive Oil rather than cooking spray in the skillet, works just as well. It was so very easy. I will use this recipe from now on! Thanks!"}, {"name": "Maria", "rating": 5, "body": "First let me say this is a fab website for beginner cooks, I'm new to this site and I've only taken a real interest in cooking for my family 3 years ago when I started staying home full time. Anyway,back to the meatballs not only was it an easy recipe to follow,but the meatballs were really good. You would think my 14 year old was NYC food critic with the way he comments about my food,but he told my husband that he liked these so much he was speechless for once. Great recipe I'm becoming more confident with every meal I cook because if this website."}, {"name": "CookinBug", "rating": 4, "body": "This produced a really fresh tasting sauce, which I definitely appreciate! I added fresh garlic and mushrooms (sauteed in a bit of olive oil) to the sauce just because those are 2 things that are vital to spaghetti sauce in this house! The sauce was very simple, but *really* tasty. The only thing I had a problem with were the meatballs... I think next time I will cut the seasoning in half as the italian seasoning was overwhelming; it kinda ruined the flavor of the meatballs for me. That being said, the meatballs had the BEST texture and consistency. Thank you very much, CookingDiva!"}], "aggregateRating": {"ratingValue": "4.5", "ratingCount": 99}, "nutrition": {"calories": 491, "carbohydrate": 66, "cholesterol": 120, "fiber": 12, "protein": 42, "saturatedFat": 3, "sodium": 876, "sugar": 11, "fat": 8, "unsaturatedFat": 0}},
    {"url": "https://www.allrecipes.com/recipe/190782/best-ever-meatloaf/", "category": ["Dinner", "Recipes"], "title": "Best-Ever Meatloaf", "description": "Condensed tomato soup is baked into the meatloaf for flavor, and also makes a tasty pan sauce to serve on the side.", "ingredients": ["1 (10.75 ounce) can Campbell's® Condensed Tomato Soup (Regular, Healthy Request® or 25% Less Sodium)", "2 pounds ground beef", "1 envelope dry onion soup and recipe mix", "0.5 cup dry bread crumbs", "1 egg, beaten", "0.25 cup water"], "instructions": [{"type": "HowToStep", "text": "Thoroughly mix 1/2 cup tomato soup, beef, onion soup mix, bread crumbs and egg in a large bowl. Place the mixture into a 13x9x2-inch baking pan and firmly shape into an 8x4-inch loaf.", "image": null}, {"type": "HowToStep", "text": "Bake at 350 degrees F for 1 hour 15 minutes or until the meatloaf is cooked through.", "image": null}, {"type": "HowToStep", "text": "Heat 2 tablespoons pan drippings, remaining tomato soup and water in a 1-quart saucepan over medium heat until the mixture is hot and bubbling. Serve the sauce with the meatloaf.", "image": null}], "image": {"type": "ImageObject", "url": "https://www.allrecipes.com/thmb/fRChUKJ5Y5JYG4iHnd-EL6pTj6g=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/981560-cd44a93c6e3c4f338ae8515e76589834.jpg", "height": 250, "width": 250}, "video": "No Video", "datePublished": "2009-02-13 16:45:55", "servings": 8, "cookTime": "PT80M", "prepTime": "PT10M", "reviews": [{"name": "Rebecca Metcalf", "rating": 5, "body": "Delicious! It is flavorful and easy to make. I made mine with crackers, since I didn't have bread crumbs. I also put it in muffin tins and add cheese."}, {"name": "Sarah E.", "rating": 5, "body": "Simple, easy and always delicious"}, {"name": "Lisa", "rating": 5, "body": "This is a simple recipe and it’s delicious! My husband loved it and he is very picky about other meat loaf recipes that’s not his. Thank you for this recipe we really enjoyed it."}, {"name": "miss chickadee", "rating": 5, "body": "Made as directed- easy and delicious!"}, {"name": "Angela loeb", "rating": 5, "body": "Delicious"}, {"name": "Annette Clark", "rating": 4, "body": "I will make again , when I did make it , the only changes I made was that I changed the portion of what all went in , but it was an excellent meatloaf."}, {"name": "Julia", "rating": 5, "body": "I made this without the water and used 3/4 of the can of soup. I also added a few dried spices and some brown sugar to the mixture. When the meatloaf was done, I mixed the remaining soup with some more brown sugar and a pinch of dried mustard and brushed in on top of the meatloaf. Not only was it delicious, but has the added bonus of being quick and easy. Thank you for sharing this recipe."}, {"name": "Terri Robinson", "rating": 5, "body": "Excellent recipe. I enhanced using 1 envelope onion/mushroom soup mix, regular tomato soup, and added chopped onions, garlic powder and a dash of worcestershire. It was very tasty! Gobbled up the leftovers too!"}, {"name": "Anne Collins", "rating": 5, "body": "Made a few adjustments to the recipe; I did add a little garlic and some bell pepper to the mixture.. The tomato soup was really good in this recipe and I did only used about half of the onion soup mix because it can be very salty but I will be making this again."}, {"name": "Faye Dodd Blewett", "rating": 5, "body": "This is the best meat loaf ever! It's easy &amp; quick. We love it."}, {"name": "Bonnie S.", "rating": 4, "body": "I thought it was very good. My husband loved it! I used all of the soup and put ketchup on the top."}, {"name": "Jennifer Periard", "rating": 4, "body": "This was a very easy to make meatloaf. I made just a couple of change: I didn't make the sauce, I just mixed the rest of the soup with the water and poured it on top of the loaf and baked it. I added salt, pepper, garlic salt and minced garlic. So yummy. I made it bigger and just added some ketchup and extra breadcrumbs. My family loved it and my daughter's friends too. I will make this again."}, {"name": "gentlearts", "rating": 5, "body": "How could something this simple be so good? I was suspicious. I made the recipe as written, and the only thing I will change next time is to use a second can of tomato soup, because hubby likes more sauce.\nI made the meatloaf early in the afternoon and let the flavors from the onion soup bloom in the meat mixture."}, {"name": "Valkira", "rating": 5, "body": "Simple is the best!!! I hate ketchup so I was happy to find this recipe. I used french onion soup mix, msg and preservative free. Extra lean organic ground beef and two eggs. Also I used my home made low carb bread that I toasted and turned into breadcrumbs. It was very delicious served with fresh garden salad and homemade dressing."}, {"name": "mads06mama", "rating": 1, "body": "Will not be making this one again. I made it as written and was very disappointed considering all the rave reviews. I found the flavor - or lack thereof - really bland. Not a big fan of the \"solid\" texture either."}, {"name": "Mr D", "rating": 5, "body": "Love this recipe. I substitute 1/4 cup of ketchup for the tomato soup. You can also divide it into patties and cook for around a half hour for delicious meatloaf burgers."}, {"name": "thea doherty", "rating": 5, "body": "meatloaf"}, {"name": "Msiesha", "rating": 5, "body": "We absolutely love this recipe. Me and the men in my household. My sons 9 &amp; 3, and my husband thinks it is the best meatloaf ever. The only thing I did differently is use ritz crackers instead of bread crumbs. I also used fresh ground turkey instead of beef. The onion mix made this scrumptious! Quick, easy, and delicious! Who would have ever thought a hunk of meat can taste so good!"}, {"name": "Sarah Jo", "rating": 3, "body": "I added a few spices to the meat loaf (italian seasoning, onion powder, garlic powder, worchestershire sauce, red pepper flake) and because I'm out of croutons, I used equal amounts Texas Toast croutons that I ran through the food processor. When I made the gravy, I sauteed some chopped onion and fresh garlic in a little butter until browned, then added the water, tomato soup and some dried basil and dried oregano. This was good, I think if I hadn't added spices, it would have been very bland. That said, this was a very moist meat loaf."}, {"name": "Colleen Sawyer", "rating": 5, "body": "This is one of the few meals that my guy begs for. I substitute Ground Turkey for the Ground Beef - and no one notices. I always find difficulty keeping turkey moist, but the tomato soup takes care of that."}, {"name": "omahataxidriver", "rating": 5, "body": "My husband and kids loved this recipe It dosen't have the onions and peppers alot of meat loafs have making them look like fruit cakes. It really turned out wonderful with just a few cabinet ingredents!"}, {"name": "swee_pea", "rating": 5, "body": "I really like this recipe, my husband loves meatloaf and I find it just okay, I made this at a family dinner and my parents really loved it too. Of all the meatloafs I have made I definitely like this one the best, I am pretty genrous with the tomato soup and normally put in more then the recipe calls for as I hate dry meatloaf"}, {"name": "mstammi", "rating": 4, "body": "Pretty good, I had to use Italian bread crumbs because that is what I had on hand. Simple. Will definitely make again."}, {"name": "Mattison Family", "rating": 5, "body": "Julien's Favorite"}, {"name": "Tracey", "rating": 4, "body": "Good, kids liked it."}, {"name": "Breannazar", "rating": 5, "body": "This is, aptly named, the best ever meatloaf. My family loves this recipe because it's juicy and perfectly seasoned. Also, the tomato gravy is great! I grew up on meatloaf and ketchup and always thought it was 'almost' right. I had no idea that tomato soup was the answer! This is also SO EASY. My only substitution is oatmeal instead of breadcrumbs, because I always have oatmeal on hand. Love this recipe."}, {"name": "cadylee", "rating": 5, "body": "I LOVE this meatloaf. My only complaint is that there isn't more sauce, but I don't know how I'd make more without opening another can of soup! It's also good with a little bit of worcestershire sauce, or Italian instead of plain bread crumbs."}, {"name": "food friend", "rating": 3, "body": "sauce was good. Found meatloaf to be salty even though I used low sodium tomato soup."}, {"name": "KRANEY", "rating": 5, "body": "This was awesome, and I mistakenly used regular tomato soup instead of low sodium. I wish I had used 2 eggs as another person suggested because it did need a little more 'binding' material. I omitted the water, and just used the entire can of soup, then spread ketchup on the top after baking. This was so easy &amp; fast compared to my standard one in which I have to cut and saute' onions and bell pepper. Thanks for the recipe!"}, {"name": "mabelle", "rating": 2, "body": "just ok"}, {"name": "traci w.", "rating": 3, "body": "Mine didnt stick together! But it was yummy :)"}, {"name": "Ashley Strayer", "rating": 5, "body": "My six year old rated this 10 stars and said it was \"pretty good!\" That's enough for me to make it again. Mu husband got bad heartburn, though, from the tomato soup."}, {"name": "Steve Whiting", "rating": 4, "body": "Easy to make. My husband liked a lot better than most meatloaf recipes, but I didn't think anything really special."}, {"name": "Tricia355", "rating": 5, "body": "Great, easy recipe. Only thing I changed was added some Worcestershire to the sauce. Hubby and my 2 year old LOVED this. Well, even my 10 mo old loved it!"}, {"name": "danihughes", "rating": 5, "body": "Delicious!!! My toddler rarely eats meat of any kind no matter how I prepare it. I made this for dinner last night with a side of steamed veggies and he cleared his plate! I did add cubes of cheese to the meat mixture because my family loves cheese in meatloaf. I also tried a sauce based on another review. I mixed the leftover tomato soup with a few tablespoons of honey and some ketchup then poured it over the top with about twenty minutes left. It tasted fantastic. Nice and moist and full of flavor. I will definitely make this again."}, {"name": "Sunlitme", "rating": 5, "body": "PERFECT!"}, {"name": "Bayla Meltzer", "rating": 4, "body": "Made this last night for dinner and the family really enjoyed it. Truthfully, it's nothing special, however, it is very fast and easy to put together."}, {"name": "Tammy", "rating": 4, "body": "The flavor of this meatloaf was OUTSTANDING! The only reason I didn't give 5 stars was because the meatloaf didn't retain it's form very well and fell apart easily. I followed the recipe to the letter so I am not sure why this happened. But definitely a keeper!"}, {"name": "Trent Ramsey", "rating": 5, "body": "The best meatloaf I ever tasted. The only change I made was that I used a whole can of tomato soup instead of half a can.\n\nTyler"}, {"name": "messycook", "rating": 5, "body": "Good, easy tasty basic meatloaf recipe. Kid friendly too! My kids kept going back for more......"}, {"name": "suppers", "rating": 5, "body": "I got a Campbell's cookbook when I got my own apt over 20 years ago, and this is one of my favorite recipes! Great with either tomato or mushroom soup. Can't go wrong, and it's very easy!"}, {"name": "Ramsee", "rating": 1, "body": "I tried eating it , but i accidently stabbed myslef! Thanks alot \"BEST MEATLOAF\""}, {"name": "JesusPotatoes", "rating": 5, "body": "This is good, but not enough eggs. I usually use 10-12 eggs. Really brings out the meatness. It was Nunpunch's suggestion."}, {"name": "awilkinson", "rating": 4, "body": "Very good and very easy!"}, {"name": "NGM", "rating": 5, "body": "This recipe is super easy to make and delicious!!! I had never made meatloaf before but I will definitely be making it again!!! Thanks!! :)"}, {"name": "Jeffrey", "rating": 5, "body": "This was awesome!! made it as written, but, instead bred crumbs I used crushed seasoned croutons left over from a Thangsgiving stuffing mix. I also used 2/3 of the soup in the mix, and laid 1 full strip of apple smoked bacon, along w/remaining 3rd of the soup across the top before baking. Moist and delicious! I served it w/oven mac and cheese and steamed veggies. It created a perfect, hearty Wisconsin winter plate!"}, {"name": "3069mich", "rating": 5, "body": "Excellent and easy, turned out perfect, thanks so much."}, {"name": "Jennifer Noble Ethridge", "rating": 4, "body": "This was a good meatloaf recipe - I liked this better with the dried onion soup mix better than recipes with fresh onions...I added about 1/4 cup brown sugar to the sauce and would have preferred it thicker...That is my only improvement needed!"}, {"name": "faucet1929", "rating": 4, "body": "very good recipe. I use chilli sauce on top, great flavor."}, {"name": "natalie", "rating": 4, "body": "It was good, but felt like it needed something. I'll try to add all the tomato soup next time."}, {"name": "etherrien", "rating": 5, "body": "I made this for the first time tonight, and I was wary at first because my husband has been really picky lately and we were having company. I served it with Au Gratin potatoes and mixed vegetables, and brownies for desert. It was a huge success! My husband had two helpings and requested that I save the leftovers for his lunch tomorrow! The only things I did different were to add some ketchup to the mix, and use ketchup as a glaze rather than the tomato soup and water combination. I didn't use the onion soup because neither of us like onions, and the meatloaf still had plenty of flavor! I will definitely be making this dish again!"}, {"name": "gloriabeatrice", "rating": 1, "body": "I didn't think this was special at all and it was WAY too salty. Still searching for that ultimate meatloaf like mom used to make."}, {"name": "soapscrubs", "rating": 5, "body": "My new go-to meatloaf recipe! Love it. As other comments mentioned, you can do this recipe with only 1 to 1 1/2 pounds of beef."}, {"name": "leonora", "rating": 5, "body": "This was amazing. I didn't have tomato soup so I used my leftover tomato sauce, and put in a little more than was stated. It came out delicious! The family loved it, and it was even better the next day."}, {"name": "Sarah K Broadfoot", "rating": 3, "body": "This was ok. It had a very strong onion soup mix flavor that my boyfriend and I weren't a big fan of. I also prefer oatmeal to breadcrumbs in meatloaf as it makes the texture much lighter and fluffier. Will not be making this again."}, {"name": "JILLTOONS", "rating": 5, "body": "Wonderful and simple. I realized I didn't add the water - but didn't need it. I just put the rest of the tomato soup on top of the meatloaf in the last 10 minutes. Soo good! Husband at 3 pieces and said - this is going to make the best sandwiches! I will make again for sure!"}, {"name": "sherip2005", "rating": 5, "body": "made this and all 8 of my kids loved it even the picky ones! Including myself! I always hated my mom's meatloaf as a kid but with this recipe it makes it taste so much better. I didn't have tomato soup so used ketchup instead and it turned out amazing!"}, {"name": "melissaheartland", "rating": 3, "body": "I made this with a pack of taco seasoning because I was out of onion soup mix. It tasted a bit like something from taco bell but my husband and daughter loved it. I wouldn't make it for myself but if you have picky kids and you know they already eat tacos it might be worth a try."}, {"name": "Morgan", "rating": 3, "body": "My husband really enjoyed this recipe but unfortunately I found it a bit boring. I added a chopped onion and some spice to give it a kick. Otherwise, I followed the recipe exactly. But I'm beginning to think that I'm just not a meatloaf person. For the leftovers we mixed with some simple gravy and mashed potatoes which I enjoyed it more that way."}, {"name": "inafog1", "rating": 5, "body": "Super easy and yummy. Even the picky boyfriend liked it. I didn't care for the tomato soup sauce that it's served with though. Next time will experiment with just adding the rest of the soup to the loaf."}, {"name": "Catina Campbell Kirkpatrick", "rating": 5, "body": "I made this with \"Meatloaf Mix\" (a blend of meat - pork, veal, beef,...) from our local grocery store and it was a hit! My kids LOVED it! :)"}, {"name": "Rex Hutcheson", "rating": 4, "body": "10-20-11: I enjoyed this more than Ann; the meat (85% lean) was too fatty for her taste. She suggested using ground round next time."}, {"name": "verobarri", "rating": 5, "body": "It holds up to its name! My very picky 2 year old had 2 servings."}, {"name": "Joan D'Esposito", "rating": 5, "body": "I have been using this Campbell's recipe since the 70's. Simple and the best!"}, {"name": "CookingChristi", "rating": 5, "body": "Love this meatloaf and so does my 7 year old picky eater! Only change I make is in the sauce. I use the remaining condensed soup but mix with ketchup and honey and drizzle over the meatloaf when there's about 20 minutes remaining of cook time."}, {"name": "marlindo", "rating": 5, "body": "Sometimes I use corn flakes instead of bread crumbs and it gives it a different but very good taste."}, {"name": "gbrenda", "rating": 5, "body": "I have been making it this way for 49 years. I usually add an extra egg and 1 to 1-1/2 lbs extra lean ground beef. I also put a layer of catsup on the top before cooking. The tomato soup makes a great tasting sauce. I still have my old Campbell Soup cookbook that I received as a shower gift almost 50 years ago."}, {"name": "Jessica", "rating": 5, "body": "This was incredible! It was the first time I ever made meatloaf and it was surprisingly simple. It came out extremely moist and my husband and son completely inhaled it! Definitely recommend!"}, {"name": "Allrecipes Community", "rating": 5, "body": "I made this as written except that I mixed all of the tomato soup in with the meatloaf. The recipe lives up to its name."}, {"name": "lynnshamrock", "rating": 4, "body": "Everyone loved this meatloaf. It was a little salty for me though. But, it was still really good. It had good flavor. I will make this again."}, {"name": "gtrchick82", "rating": 4, "body": "This meatloaf was pretty good. I mostly followed the recipe. I only had 1.5 lbs of ground beef and I added a one chopped up bell pepper. Also, I didn't use the other half of the soup for the topping because I used ketchup instead."}, {"name": "cheri", "rating": 4, "body": "My husband LOVES meatloaf but complains that I put too much onion in it. The onion soup mix eliminated that problem! Delicious! We put ketchup on top instead of the tomato soup."}], "aggregateRating": {"ratingValue": "4.4", "ratingCount": 99}, "nutrition": {"calories": 297, "carbohydrate": 13, "cholesterol": 91, "fiber": 1, "protein": 21, "saturatedFat": 7, "sodium": 633, "sugar": 4, "fat": 17, "unsaturatedFat": 0}},
    {"url": "https://www.allrecipes.com/recipe/193585/authentic-bangladeshi-beef-curry/", "category": ["Beef", "Stews"], "title": "Authentic Bangladeshi Beef Curry", "description": "This spicy beef curry is best served with plain basmati rice or eaten with naan or pita bread. It can be made on the stovetop, in a slow cooker, or in a pressure cooker.", "ingredients": ["3 tablespoons olive oil", "1 onion, chopped", "6 cloves garlic, minced", "5 green chile peppers, finely sliced", "1 teaspoon ginger paste", "3 whole cardamom seeds", "2 whole cloves", "1.5 (2 inch) cinnamon sticks", "1 teaspoon ground cumin", "1 teaspoon ground coriander", "1 teaspoon ground turmeric", "1 teaspoon garlic powder", "1 teaspoon cayenne pepper", "1 cup water", "2 pounds boneless beef chuck, cut into 1-1/2-inch pieces"], "instructions": [{"type": "HowToStep", "text": "Heat olive oil in a skillet over medium heat. Add onion; cook and stir until the onion has softened and turned translucent, about 5 minutes. Reduce heat to medium-low and continue cooking and stirring until the onion is very tender and dark brown, 15 to 20 minutes more.", "image": null}, {"type": "HowToStep", "text": "Stir in the garlic, green chiles, ginger paste, cardamom seeds, cloves, and cinnamon sticks. Cook and stir until the garlic begins to brown, 3 to 5 more minutes.", "image": null}, {"type": "HowToStep", "text": "Mix cumin, coriander, turmeric, garlic powder, cayenne pepper, and water into the onion mixture. Simmer until most of the water has evaporated and the mixture has thickened.", "image": null}, {"type": "HowToStep", "text": "Stir in beef chuck pieces until coated with spice mixture; simmer over medium-low heat, stirring occasionally, until the beef is cooked through and tender, about 1 to 1 1/2 hours.", "image": null}], "image": {"type": "ImageObject", "url": "https://www.allrecipes.com/thmb/g1nY4bNLbjxAMcktdNu8rPJLuB4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/259951-d3f02a77d31941e8919a4bd1bc92e970.jpg", "height": 960, "width": 960}, "video": "No Video", "datePublished": "2019-04-03 23:47:31", "servings": 6, "cookTime": "PT105M", "prepTime": "PT30M", "reviews": [{"name": "Allrecipes Member", "rating": 4, "body": "Perfect beef recipe, easy to cook n had cooked many many time 😊"}, {"name": "Mina Y", "rating": 2, "body": "I hate ever giving a less than wonderful review but this is one. While it looked good on paper, the end result was dry because there was absolutely no sauce in it for the meat or rice (even a little would have been okay- maybe if you shrink the amount of meat or double the wet ingredients and spices it would work). The other issue I had was a lack of flavor. You could taste a hint of hot pepper after taking a few bites but the curry \"flare\" was gone. Actually, most of the flavor was gone- disappointing because I REALLY wanted to like this!"}, {"name": "Steve Urso", "rating": 4, "body": "The family and I loved this beef curry! The spice combo was so fragrant , it made the house smell just like an Indian restaurant. I modified it a bit by adding 1 large diced tomato and about a half cup of milk for more simmering liquid it needed. when the meat was tender I finished the sauce with 2 Tbsp. tomato paste and 1/2 cup heavy cream to adjust thickness."}, {"name": "helen baillie", "rating": 5, "body": "i added canned tomatoes, green peppers and mushrooms and doubled the spices"}, {"name": "Tomer Mor", "rating": 4, "body": "the dish is very tasty we liked it a lot."}, {"name": "Peter G", "rating": 2, "body": "Made it as suggested, it was moderately spicy, but if you are looking for authentic, take it from an actual Asian, this is fairly bland."}, {"name": "Roger", "rating": 4, "body": "I did it in a pressure cooker and I would add another cup of water, otherwise amazing."}, {"name": "Douglas ", "rating": 5, "body": "Great recipe! Will definitely make this again. We cut back on the hot peppers (by 50%) that was a good choice because it was still fairly spicy."}, {"name": "CJ McMilian", "rating": 5, "body": "So Yummy! We left out the cloves (hubby doesn't like cloves) but otherwise kept to the original recipe."}, {"name": "GTIkitty", "rating": 4, "body": "Ive made this a couple times now and it’s very good. However I couldn’t put my finger on why it seemed to be missing something, other than much needed salt. Then it dawn on me - Most south Asian curries are made with heavy cream or coconut milk. I added a can of coconut milk near the end of simmering and wowzers! It really pulled the depth of flavour out of the dish. Delicious. You could also add a tablespoon or so of brown sugar for a sweeter version too."}, {"name": "Stormy Martinez", "rating": 5, "body": "Granted... I may qualify as a person who has changed this a bit much but this recipe is excellent and I’ve been cooking it for years now... only I serve it over riced cauliflower as part of my ketogenic diet. I go a little heavier on the olive oil, I triple the recipe and I use 12 seeded sliced jalapeños with 3-4 sliced white onions. All the spice combos are the same but I cut the cayenne in half. I use a big hunk of fresh ginger and a whole head of garlic. This works for any protein. When I use chicken I put a nice chunk of butter in there. The trick is turning the peppers, onions and spices into a thick gravy by cooking it down before adding the meat. Then simmer the meat 2 plus hours. In a giant wok, 2 sticks of butter for 3 giant heads of shredded cauliflower. Seriously delicious! I can handle the full cayenne but some of my family members cannot."}, {"name": "Berdena Walkley", "rating": 5, "body": "Most definitely will make it again taste just like what I had when visiting Bangladesh"}, {"name": "Carol", "rating": 4, "body": "I used the slow-cooker version, so simple. I marinated spices in the brown beef cubes overnight and just dumped in the slow cooker for 7 hrs. Really good."}, {"name": "paul", "rating": 3, "body": "not the best curry recipe ive tried. Missing salt and too much cayenne. If i was to make again, i would use lamb and a 3rd of the cayenne, add half a tsp of salt and instead of water add a can of chopped tomatos"}, {"name": "FlourChild", "rating": 5, "body": "Great recipe, not to mention the absolutely wonderful fragrance that filled the house. Started out using the electric skillet which was perfect for caramelizing the onions. Intended to continue with the skillet method, but due to time constraints transferred everything to the pressure cooker. Since I used a more tender cut of meat (sirloin tip roast), cooked it on medium pressure for 25 minutes and used a full can of beef broth instead of the cup of water. The only other changes were substituting 2 small cans of chopped green chiles for the fresh peppers and a scant tsp ground cardamom for whole seeds. Talk about melt in your mouth tender – WOW! Next time, I'll use the fresh peppers and whole cardamom seeds and try just 15 minutes in the pressure cooker. Thanks so much for the recipe."}, {"name": "Kathy B", "rating": 4, "body": "I made it in pressure cooker, very easy, cannot believe how good it smelled. A wonderful spice combo. I will try with chicken too. I used not as much heat, but I did use all ingredients."}, {"name": "Jamie Young", "rating": 3, "body": "This is not modified for pressure cooker -- pressure cooker required much more liquid and was therefore burnt."}, {"name": "Tony Thor", "rating": 4, "body": "PRESSURE COOKER NOTES: The sauce was GREAT but the meat should have been cut into smaller chunks to absorb more flavor. (I used regular pre-cut stew meat, way too big) And, all my vegetables were totally vaporized by the pressure cooker. If I make this again I am going to ignore the step where you cook the garlic and pepper before you close the lid and cook for 40, and as well I am going to use much smaller chunks of meat. I suspect next time I make it it will be better."}, {"name": "Terri Dale", "rating": 4, "body": "DH is from new Zealand and fancied some curry like his mum used to make. First time making and hubby said it was delicious. Not Mum's, but very good curry. I only added 3 peppers and did not include the seeds. Next time I\"ll use as written with seeds. Followed directions and then cooked it in an electric pressure cooker on hi for 55 minutes. Excellent texture and flavor! Thanks for the great recipe and instructions! P.S. taking time to slowly brown the onions is key! Beautiful color and flavor!"}, {"name": "Lonnie Davis", "rating": 4, "body": "Didn't use the cardamom. Thought it would make it too smokey. I think we made the right choice, but man was it spot on for authentic curry."}, {"name": "Keely", "rating": 2, "body": "I used a pressure cooker. It just didn't work."}, {"name": "joy", "rating": 3, "body": "use mustard oil , that is more authentic for bangladeshi dishes , and use at least 4-5 onions if it medium sized and use 2-3 onions if it is large size ."}, {"name": "Ilikefrenchies", "rating": 5, "body": "This was very good. Just needs a little bit of salt."}, {"name": "Bevswright", "rating": 5, "body": "Loved it. Added Yukon gold and sweet potatoes, cubed, instead of serving it over rice. Definitely a repeater in our household."}, {"name": "Kevin Brown", "rating": 1, "body": "not sure what went wrong. I did not like the flavour, found it bitter."}, {"name": "henriques_p", "rating": 4, "body": "I made it with cubed beef brisket, but after an hour and a half was not tender enough, so transferred to a pressure cooker for 12 minutes. Excellent flavours and meat was quite tender with a nice thick sauce. Would definitely make again."}, {"name": "Joanna Jamil", "rating": 4, "body": "The only thing I did differently was to let the gravy cook down little bit and added some coconut milk. The creamy sweetness of the coconut milk really added to the dish. HOWEVER, do not add the coconut milk at the beginning of the cooking, but at the end or it will curdle. Yes coconut milk can curdle.....I learned that the hard way."}, {"name": "scottenrick90", "rating": 2, "body": "Decent taste next time I will be sure to switch the cup of water out for coconut milk."}, {"name": "Kelly K", "rating": 5, "body": "Great recipe. I find the recipe a little bit too \"tumericy\" if that's even a word. I added a little bit of generic \"curry powder\" into the mix which thickened it up. Also added extra ginger paste."}, {"name": "Matthew Trow", "rating": 4, "body": "Very tasty. I'd recommend quickly searing the beef over a high heat before starting on the onions and setting it to one side until ready to add again. Seared beef adds even more depth to the flavour. If done quickly and evenly, there's no need to clean the skillet before starting on the onions.\n\nI couldn't get any chuck from my supermarket, so I had to settle for the leaner braising steak - and thus bumped up the cooking time to 2.5hrs. I had to keep adding a little water, even during the recommended cooking time, to prevent the dish from drying out.\n\nThe only other change I made was to add a bay leaf, as it's clear the spices in this recipe are cleverly balanced, ending up with a wonderfully deep and rich curry flavour.\n\nEdit: I've cooked this curry 4 times since, slightly varying the method. Every time it turns out great. My latest addition is to add chopped potatoes. I've also experimented with even slower cooking - 5 hours, low heat. \n\nThe trick is obviously in correct spicing, but as important, the length of time the onions cook for. They really do need to be quite a dark brown to get a full flavour. Beware, however, if you burn them don't even bother going any further. Chuck them out and start again. \n\nThe same applies to the spices - any hint of burning before adding the meat, start again."}, {"name": "Kashfia88", "rating": 5, "body": "I've made this several times and it has always been a hit! Don't usually alter the recipe but might add potatoes occasionally to make a bit heartier."}, {"name": "Danley Shackelford", "rating": 5, "body": "Very good! I didn't have quite all the ingredients. I substituted powders where I didn't have fresh, but everything still came out very very good. My wife was out of town. I'll definitely make it again for her. Thanks for the recipe!"}, {"name": "kkimmel507", "rating": 4, "body": "Fantastic! I used red chili flakes and Habanero peppers which did not alter the flavor but gave it the heat I was looking for. Thanks for this post."}, {"name": "Allrecipes Member", "rating": 4, "body": "Fantastic! I used red chili flakes and Habanero peppers which did not alter the flavor but gave it the heat I was looking for. Thanks for this post."}, {"name": "Kitty", "rating": 2, "body": "This turned out really dry and practically flavorless except for pepper for me. I'm so bummed 'cause it smelled so good. Clearly I did something wrong, but I'm not exactly sure what, except that maybe 1 hour was too long for me. Also, I prefer more sauce in my curry, so I'd put more water and spice into it next time."}, {"name": "Stay-C", "rating": 3, "body": "I liked the flavours, but it definitely needed salt. The beef didn't take the flavour on very well either so I may try marinating it for a few hours before cooking next time. Thank you for the recipe. I will try it again with modifications."}, {"name": "forrestang", "rating": 4, "body": "I was BLOWN AWAY with this dish-SLOW COOKER VERSION!\r\n\r\nI cracked the cardamon husks to expose the seeds, and placed them with the cinnamon and cloves into a garlic package for easy removal at the end. \r\n\r\nI couldn't find ginger paste, so I added about a tbsp of freshly minced ginger root with a few drops of Olive oil. I also couldn't find chile peppers so I used 2 green Serrano peppers. I think I have a decent tolerance for spice, and this was just about the right amount of heat for me. Served with basmati and sweet-cornbread. It was DELICIOUS!!!!"}, {"name": "thatpoegirl", "rating": 5, "body": "I made this with extra garlic, minced fresh ginger, and coconut milk instead of water. The spice mixture I kept the same. Delicious blend of spices!"}, {"name": "CASPER76", "rating": 3, "body": "Did this in the slow cooker using the instructions here. If you do, watch it carefully and add water or stock when necessary. Mine dried out. Also...it needed salt. I rarely cook adding salt but this really needed it. Not sure I'll make it again."}, {"name": "mhughescmu", "rating": 2, "body": "I did not enjoy this recipe at all. I felt it was bland. Not sure why."}, {"name": "ummbarhuma", "rating": 4, "body": "Very flavourful, and tastes almost as good as the curry my Bengali friend makes. That's why it's only a 4. But it's better than i can come up with on my own. Definitely will make again."}, {"name": "ptulip", "rating": 4, "body": "Interesting recipe ~ I made this when running short on time for making family dinner. I used my pressure cooker and had it on the table in 35 minutes. I made it with all the ingredients listed and then put my own spin. I added on rib of celery, 1/2 red bell pepper. Then slightly thicken the juices at the end to give it body. The family absolutely love it."}, {"name": "Pooboy", "rating": 5, "body": "I cooked this yesterday and ate it today, it was bang on, I dry roasted the coriander and cumin seeds, 2 cloves about 8 black peppercorns and blitzed to a powder thats all I changed next time though I will add some potato but this was lovely I would say the best Beef curry I have cooked as I dont like coconut milk, yoghurt and tomatoes in my indian curry this was perfect very simple and easy"}, {"name": "aimeelynn", "rating": 4, "body": "This really good, I doubled the sauce so we could have more, did steps one and two, and then put it all in the crockpot for about 7 hours on low. The meat was really tender (even for stew beef) and the sauce had great flavor, though it was really spicy, even for spicy food lovers. I also added some spinach and left over mashed potatoes at the end which made for a nice consistency, and served with peas and corn. My husband had his over rice, I ate quinoa, and both worked nicely. Thanks!"}, {"name": "ValleyLily", "rating": 3, "body": "I changed a lot of the recipe due to the length of prep. Most notably I used stew beef instead of regular beef. I didn't use cardamom and I used jalapeno slices instead of green chilies. I used beef stock instead of water and added more of it so that it would submerge the beef and the potatoes I added. I basically threw it all in the crock-pot and cooked it on low for about 9 hours, which unfortunately was too long for the stew beef. However, flavor wise, it seemed like something was missing. I don't know if I'd eat this again."}, {"name": "Cyd_Delve", "rating": 5, "body": "this was delicious! We are big fans of curries, and this was simple to prepare, used ingredients I had on hand, and tasted great. I used sirloin (the result of sending the hubby out for chuck roast), and omitted the fresh chilis: I substituted a good pinch of cayenne. Next time, I'll use at least one chili and chuck roast. Served with plain broccoli and basmati rice---thank you!!!"}, {"name": "Kelly Searsmith", "rating": 4, "body": "I followed this recipe just as written, except that at the point when it says to simmer the beef with the spicy paste mixture, I put these elements into a slow cooker for 4 hours. The recipe turned out great -- fragrant and delicious. I served over Jasmati rice, with a light dusting of salt as a finish. Next time, I will up the spice level (perhaps by adding more cayenne pepper and minced hot peppers). Also, I may make the spicy paste mixture a day in advance, so that the beef can marinade in it overnight before going into the slow cooker (the lovely flavor of the spicy paste mixture did not quite penetrate each piece of beef, even after cooked slowly for a long time). Thanks to the author for sharing!"}, {"name": "iphee", "rating": 4, "body": "I was looking for a non-traditional crock-pot recipe for stew beef and this fit the bill. With the crock-pot I added everything but the oil and powdered spices right away. I didn't have hot peppers or garlic on hand so instead used green chili paste and used beef broth instead of water. Another reviewer added the powdered spices (cooked in the oil) about 1-2 hours before it was done and I did the same. I'm really pleased with how this came out and it was super easy to prepare. The only thing I would do differently next time would be to add some veggies."}, {"name": "Emily Kris", "rating": 3, "body": "Needs salt and more cooking time, mine took about 3 hours until it was tender. Overall it was very easy to make but I don't know if I will make this again. It wasn't bad but there are better curry recipes on this site that taste better in my opinion."}, {"name": "gigi1957", "rating": 5, "body": "I made this and loved it! I added peas and potatoes to make a complete meal and omitted the rice. Excellent! And added 4 cloves of garlic as well."}, {"name": "CourtneyNS", "rating": 5, "body": "loved the recipe! Mixed the spices together the night before just to save time. Didn't have ginger pasted used 1tsp powdered ginger instead,and 1/2 tsp ground corriander instead of cardimum. My family loves curry-this is a HUGE hit in our house. We added fresh cilantro on top, and ate with Naan. Can also mix everything in a baggie and freeze for the slow-cooker. Going to give it to a girl friend like that when she has her baby so all she has to do is dump it in the crock pot on high for an extra hour. Love the way my house smells while its cooking."}, {"name": "merlion", "rating": 4, "body": "Spicy stuff! I used serrano chiles and did not de-seed them. This is different from the tomato-based curries and the coconut-based curries for sure. Tasty but I think I am more used to the other kinds of curries..."}, {"name": "canadiansharon", "rating": 5, "body": "great dinner! made this on the weekend and it was a hit! I used a more tender cut of beef so I didn't have to cook as long. I also added a half can of coconut milk as I like more sauce with my curries. Didn't have the chilis so I used some jalapenos (not a lot), and I used 1/3 tsp of cayenne. I found it flavourful but not too too spicy (I have one child who doesn't like super hot food)."}, {"name": "Amran Hajiomar", "rating": 5, "body": "Simple and delicious."}, {"name": "krbeg", "rating": 5, "body": "My husband is Bengali and loved this! He is an excellent cook and said my beef curry is better than his! I did use the pressure cooker for 50 minutes. The meat was SO tender!"}, {"name": "Allrecipes Member", "rating": 5, "body": "Delish!! \nI used pork instead... Cooking time was not long at all... I don't cook beef, so that could take the recommended time. \nNext time I will add tomato, perhaps cauliflower, and cilantro!\nThanks for the recipe!!"}, {"name": "nanciemartin", "rating": 5, "body": "I placed cut all ingredients in a large baggie the night before and the next morning I put it in the crockpot with 1/2 cup of beef broth on low setting for 6 hrs and it came out excellent! I did not use any oil."}, {"name": "atrinakay15", "rating": 5, "body": "Pefect Bangladeshi Beef Curry!!"}, {"name": "JEG", "rating": 4, "body": "Made with canned chilis and a ribeye steak cut up into chunks. Needed an additional half cup of water and an additional half hour of cooking time to make meat tender. The result was delicious and richly flavored. This is a keeper for us! Thank you for the recipe!"}, {"name": "shana", "rating": 4, "body": "Excellent! I threw the meat, potatos and some winter squash in the crock pot with onion and 3 cloves of garlic, added about 1/2 c of water, as well as cloves, cardamom and cinnimon sticks. About 2 hours before serving, I grated 5 more cloves of garlic heated it in the oil with the other spices, which was increased to 1/2 Tbs each. Added salt to taste. Served with Roti Bread and it was wonderful!! Thank you!"}, {"name": "WIdesh", "rating": 5, "body": "Super Yum! Just added a little extra chili powder b/c we like it hot-will make again!"}, {"name": "WORSHIPWARRIORMT", "rating": 5, "body": "I really enjoyed this recipe...I didn't have green chilies so I used some jalapenos...didn't have cardamom pods but I used a good size pinch of cardamom powder. Cut back on the cayenne peper (was scared it would be to hot) it was a mild medium heat. Perfect for me...Super yummy..my family loved it! Will make again for sure! :)"}, {"name": "TheBritishBaker", "rating": 2, "body": "This curry did not work for my family, did not like the overall taste at all, all I could taste was Turmeric. I really think this needs to be reduced by at least 1/2 to allow the other flavors to come through. Glad I tried this recipe, but I will not be making again."}, {"name": "Traci-in-Cali", "rating": 4, "body": "I really lovd this, although the meat wasn't as tender as I would have liked. Next time I'll simmer at least 2 hours. I halfed the cayenne and it was still pretty spicy for us and we like heat! I added an extra cup of water and about two cups of cubed potatoes the last 30 minutes. :) Thanks!"}, {"name": "skydivetofly", "rating": 5, "body": "Good Hotness and Basmati makes a great dish!"}, {"name": "Ingibjorg Jakobs", "rating": 5, "body": "Great recipe. Very authentic. The only thing I added was some salt."}, {"name": "Katie", "rating": 4, "body": "Quite tasty. Best as leftovers."}, {"name": "BEADPM", "rating": 5, "body": "Absolutely amazing flavours and melt in the mouth goodness"}, {"name": "desicook", "rating": 5, "body": "This is a very good dish. I didn't alter it that much and it is definitely a keeper. I like lots of flavor, so I tend to interpret teaspoons as largely heaping teaspoons for spices. I used a little over a pound of beef, heaping teaspoons of cumin, corriander, and turmeric, as well as minced fresh garlic (no powder required)I used the cardamom and cloves as listed, about 1 tbsp of minced ginger, and a 2 inch piece of cinnamon. I used two extra large jalapenos, which were plenty. Cayenne/red chili powder is only needed to taste depending on how spicy the peppers are and how much you can handle. Beef dishes tend to need to be cooked for 3-4 hours to be cooked properly until tender. Potatoes can also be added to this dish towards the end of cooking. I served with basmati rice and homemade naan."}, {"name": "Beth J", "rating": 5, "body": "I used 2 Serrano chilies instead of the others and I omitted the cayenne. It was spicy enough that way. I used about 1/2 c. more water as I made it in a Dutch oven and the first cup of water evaporated quickly."}, {"name": "FrancesC", "rating": 5, "body": "This was terrific. I used about half a jalapeño instead of the Thai chiles; the dish has a really nice mix of warm heat from the cayenne, and a more biting heat from the fresh chile. I omitted the garlic powder and added a few good healthy pinches of salt at the end of the cooking time. Oh, and I only used two tablespoons of oil to caramelize the onions—I used half mustard oil and half canola. We had this with basmati rice and garnished it with chopped cilantro. Next time, I'd also serve it with some sort of cooling raita."}], "aggregateRating": {"ratingValue": "4.2", "ratingCount": 90}, "nutrition": {"calories": 320, "carbohydrate": 9, "cholesterol": 69, "fiber": 2, "protein": 20, "saturatedFat": 7, "sodium": 50, "sugar": 3, "fat": 23, "unsaturatedFat": 0}},
    {"url": "https://www.allrecipes.com/recipe/177394/almost-caramel-de-lite-bars/", "category": ["Cookies", "Cake Mix Cookie Recipes"], "title": "Almost Caramel de Lite Bars", "description": "A rich, chocolate crust is topped with layers of chocolate chips, butterscotch chips, marshmallows, and coconut.", "ingredients": ["1 (18.25 ounce) package chocolate cake mix", "0.75 cup butter, melted", "1 cup chocolate chips", "1 cup butterscotch chips", "2 cups miniature marshmallows", "2 cups sweetened flaked coconut", "1 (14 ounce) can sweetened condensed milk"], "instructions": [{"type": "HowToStep", "text": "Preheat an oven to 325 degrees F (165 degrees C). Grease a 10x15 inch jellyroll pan.", "image": null}, {"type": "HowToStep", "text": "Combine the cake mix and the melted butter in a large mixing bowl. Mix until evenly moistened, then press into the prepared pan. Layer chocolate chips, butterscotch chips, miniature marshmallows, and coconut over the cake mix crust. Pour the condensed milk over the layers.", "image": null}, {"type": "HowToStep", "text": "Bake 30 minutes or until golden brown. Let cool before cutting into bars.", "image": null}], "image": {"type": "ImageObject", "url": "https://www.allrecipes.com/thmb/tpoXxCh2nVMxPtCQPad89yMW3GA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/965067-3593d19bc07e4358a62192ef1483af3e.jpg", "height": 960, "width": 960}, "video": "No Video", "datePublished": "2019-04-02 02:51:10", "servings": 24, "cookTime": "PT30M", "prepTime": "PT15M", "reviews": [{"name": "Naomi", "rating": 4, "body": "Two words WOW YUMMY....if I wasn't following a low gycemic diet I wouldn't share!"}, {"name": "Melissa Goff", "rating": 4, "body": "Very tasty bars...I don't think they tasted anything like the Girl Scout bars. Quick and easy however, stretching the cake mixture to 10x15 was really stretching it to thin, would have been better in a 8x10. As baked in a 10x15 jelly roll, the bar it self didn't hold very well and didn't get holdable pieces without falling apart and the condensed milk was stretched as well not being able to coat everything evenly for the size it was asked to use. I've made bars like this before and the last recipes I've made required an 8x10 pan. I will make these again but adjust to a smaller vessel. TY."}, {"name": "adinkel", "rating": 5, "body": "Very easy to make &amp; whole family enjoyed them!"}, {"name": "bpaulson", "rating": 5, "body": "Ummmm..... YUM! Think I just ate 1 too many, though!"}, {"name": "cs2002", "rating": 4, "body": "These were very good! Although I did not think they tasted like the caramel delight bars that I am used to having, they were yummy and gooey, 2 things I love! They were harder to cut and get out of the pan, which was probably the marshmallows, and i added extra coconut, but will be making again and again!"}, {"name": "Pengworm", "rating": 4, "body": "These were SOOOOOOO good! I love sweets and these were even rich for me. They are just like what we always called magic cookie bars except with a chocolate crust instead of graham cracker crust. I actually think it's much better and easier with the chocolate cake mix. I would've easily given these five stars but I wasn't a big fan of the marshmallow on it. I didn't like the gummy texture they got and I think it would've been better without it. Cannot wait to make these again!"}, {"name": "huskymom", "rating": 4, "body": "These were so super rich! I'm a sweet lover and could only handle a small bar. Make sure you have plenty of milk when serving these. I also want to stress that you have to make sure that these bars are cool before you cut them. Otherwise, you get a soupy mess which was still yummy, but presentation was lost. They looked so good and I got impatient."}, {"name": "Lidco", "rating": 4, "body": "I thought that these were really good in flavor. You really do need to wait until they cool completely (like a couple of hours) before you try to cut them or they will fall apart. The one problem that I did have was that they seemed to be too much for the size of the pan. When they were cooking it all boiled over and made a gigantic, burned marshmallow mess in the oven. I might try to make them in a 9x13 next time. All in all the flavor is good and I do think tastes like a Caramel de Lite Bar"}, {"name": "BUSYCOOK", "rating": 4, "body": "I don't know that these tasted anything like the Caramel de Lite Bars (at least we did not think they did), but they are good and extremely easy to make. Be warned that they are very sweet and a small piece goes along way. I only put coconut on one half so that the coconut haters in my family could have desert too. If you cut these to soon you will need to eat it with a spoon. They firm up nicely once they have cooled completely."}], "aggregateRating": {"ratingValue": "4.4", "ratingCount": 11}, "nutrition": {"calories": 313, "carbohydrate": 40, "cholesterol": 21, "fiber": 2, "protein": 3, "saturatedFat": 10, "sodium": 271, "sugar": 30, "fat": 16, "unsaturatedFat": 0}},
    {"url": "https://www.allrecipes.com/recipe/155498/pear-and-prosciutto-pizza/", "category": ["Italian", "European"], "title": "Pear and Prosciutto Pizza", "description": "Using a pre-made pizza crust dough, this pizza is topped with oven-roasted garlic and pears, mozzarella cheese, Swiss cheese, and prosciutto.", "ingredients": ["6 cloves garlic", "0.5 tablespoon olive oil", "2 ripe pears, halved and cored", "1 tablespoon olive oil", "all-purpose flour for dusting", "1 unbaked pizza crust", "1 tablespoon cornmeal for dusting", "6 ounces shredded Swiss cheese", "5 thin slices prosciutto, cut into halves", "1 (6 ounce) package fresh mozzarella, cut into small cubes", "salt and ground black pepper to taste", "0.5 tablespoon olive oil"], "instructions": [{"type": "HowToStep", "text": "Preheat oven to 375 degrees F (190 degrees C). Place the garlic in a small square of aluminum foil. Drizzle 1/2 tablespoon of olive oil over the garlic. Wrap foil around garlic to seal.", "image": null}, {"type": "HowToStep", "text": "Roast the garlic in the preheated oven until soft, about 20 minutes. Smash roasted cloves with a fork.", "image": null}, {"type": "HowToStep", "text": "Place the pears in a bowl with 1 tablespoon olive oil; toss to coat. Arrange pear slices on a baking sheet.", "image": null}, {"type": "HowToStep", "text": "Bake in hot oven until soft, 10 to 15 minutes.", "image": null}, {"type": "HowToStep", "text": "Raise oven temperature to 400 degrees F (200 degrees C). Preheat a pizza stone or baking sheet in the oven.", "image": null}, {"type": "HowToStep", "text": "Lightly dust a flat surface with flour. Roll the prepared pizza crust dough out onto the prepared surface. Dust a baking sheet with cornmeal. Lay the dough onto the prepared baking sheet. Spread the mashed garlic onto the dough; top with the Swiss cheese. Arrange the pears, prosciutto, and mozzarella cheese onto the pizza. Season with salt and pepper. Brush the edges of the crust with the 1/2 tablespoon olive oil.", "image": null}, {"type": "HowToStep", "text": "Bake in preheated oven until the cheese is melted and crust is golden brown, 15 to 20 minutes.", "image": null}], "image": {"type": "ImageObject", "url": "https://www.allrecipes.com/thmb/Z_yacXB23FIIplxmW2qM-Yh0FEA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/390110-51dd03bc03c64c6f8397d3c76dae62d0.jpg", "height": 250, "width": 250}, "video": "No Video", "datePublished": "2019-04-02 02:49:50", "servings": 4, "cookTime": "PT45M", "prepTime": "PT25M", "reviews": [{"name": "Crystal", "rating": 5, "body": "Delicious! I cooked it in a cast iron pan and added some arugula on top after cooking."}, {"name": "Douglas Markin", "rating": 5, "body": "I made the pizza as per the recipe. We absolutely loved it. I will make this pizza again. \nI will also try some of the suggestions submitted by other chefs/cooks as they also sound delicious.\nThank you for a truly wonderful recipe!!!!"}, {"name": "sydny95", "rating": 5, "body": "So good! Used Gorgonzola cheese instead and added chicken."}, {"name": "kenny powers", "rating": 4, "body": "Omg this pizza blew my mind !!! KAAAA-PLEWY !!!!"}, {"name": "kim", "rating": 5, "body": "As another reviewer stated I used a Naan Garlic flat bread as my crust. Then added 1 clove of minced garlic and olive oil as my base. Made the recipe as directed otherwise. Loved the pear and prosciutto combo, with swiss and mozarella. Then finished it off with a drizzle of balsamic vinegar. Cooked it for 15 minutes on a cookie sheet, don't put it directly on oven rack as it will drip. I like thin and crispy crust, it didn't get as crispy as I would have preferred but still wonderful. Thank You!"}, {"name": "sfisher2148", "rating": 2, "body": "Thought it'd be more flavorful, for the amount of time it took to make it wasn't worth it for me."}, {"name": "renalyn", "rating": 5, "body": "Love it over and over!"}, {"name": "Tx2gamommy", "rating": 5, "body": "I followed the recipe, did roast garlic and pears concurrently. We loved it! Might add feta and red pepper flakes next time for a little zip."}, {"name": "Kelly S", "rating": 5, "body": "SOO GOOD! yum! definitely will make again!"}, {"name": "Chae", "rating": 4, "body": "A little time consuming, but yummy. I also roasted the garlic and pears together. Am giving four stars b/c the yumminess and time it takes don't quite match. More yumminess needed for me to take the time to make this pizza, just my preference..."}, {"name": "Kathleen", "rating": 4, "body": "A nice combination of salty and sweet."}, {"name": "ChefKatie", "rating": 3, "body": "I thought this was going to be phenomenal but it was alright. I followed the directions and used d'anjou pears (very ripe and lovely!) The pizza was 1/4 eaten - it's a nice taste but I've tasted better pizzas. Thanks for the recipe though!"}, {"name": "Rachel Henderson", "rating": 4, "body": "Good but not a whole lot of flavor. I would have added more proscuitto and spices. Maybe add parmesan to instead of some of the mozerella."}, {"name": "KRISTLE", "rating": 5, "body": "Very good...different combination but went very well together...definitely slice the pears smaller. Would like to come up with an alternative to the roasted garlic only because it's a pain."}, {"name": "hillcountrygirl", "rating": 4, "body": "I absolutely love this but because of the alterations I made to the recipe I am only giving it 4 stars. I used garlic naan bread (already cooked) instead of pizza dough because it is more personal sized. I also used a small amount of pesto as a sauce and then diced up the cooked garlic and sprinkled it on pesto. After placing pears, I drizzled honey over them, then put prosciutto and mozzerella and gorgonzola crumbs for a stronger cheese flavor. Turned out amazing!"}, {"name": "janel", "rating": 5, "body": "This is wonderful. The flavors truly compliment each other. I used flat bread purchased at Whole Foods for the crust. It made for a quick and easy yet different appetizer."}, {"name": "slbross", "rating": 5, "body": "This pizza is great. Instead of just the mashed garlic, I added the roasted garlic to a balsamic fig reduction, added a little honey and oil, and blended, then just put a thin coat of this sauce on the dough and followed the rest of the recipe as directed."}, {"name": "Nicole Baloh Korte", "rating": 5, "body": "This pizza was Fabulous!! I did not change a thing and wouldn't. It is great just the way it is. Thanks for such a wonderful recipe."}, {"name": "KOALAGIRL", "rating": 5, "body": "This was really, really good. We loved the saltiness of the prosciutto balanced with the sweetness of the sliced pears. I used a prebaked flatbread for the crust. I also used canned pears that I drained well and sliced. (I skipped the baking of the pears as they were soft out of the can.) This one is definitely going in the rotation. Thanks for an awesome and unique recipe, bostoncook."}, {"name": "skylark2166", "rating": 5, "body": "Also great with bacon"}, {"name": "SunnyByrd", "rating": 5, "body": "Yum! I thought this was an excellent combo. I loved the Swiss and mozzerella together. I followed the recipe exactly except I used a prebaked crust instead of an unbaked crust. My pears were not as ripe as I wished they were, but they came out perfectly when roasted as directed. I think very ripe pears could probably go directly on the pizza without pre-roasting. Great method for quick-roasting garlic. Thanks for the recipe!"}, {"name": "mommyluvs2cook", "rating": 4, "body": "This was pretty good I was just surprised at how much all the cheese over took the pears and they really weren't that sweet. Next time I might do without the swiss. I really just didn't get much sweetness that I wanted from the pears. Loved the way the garlic is done in this though. 4 stars."}, {"name": "LHICKERS", "rating": 5, "body": "I am not a cook....but this was sooo easy and was soooo impressive."}, {"name": "Liz Polach Slocum", "rating": 5, "body": "This was amazing. I used wheat crust, and did not alter the recipe at all. I could seriously eat this everyday, it was so good and easy!"}, {"name": "dallasnurse", "rating": 4, "body": "This pizza was delicious! I had a problem though rolling out the refrigerated pizza dough.....it wouldn't roll out, just stayed in a ball. Any suggestions on using the premade pizza dough? Next time I might use Boboli or make my own dough. I think I might also add more garlic. Overall, the pizza was very good and my husband and I enjoyed it."}, {"name": "luvmylab", "rating": 5, "body": "YUM!!!"}, {"name": "DaliLama", "rating": 5, "body": "Deliciously Unique! I made this on Garlic Naan instead of pizza dough, added some Basil/Tomato Feta, and (accidentally) omitted the Swiss Cheese, and it still turned out great!"}, {"name": "Megan", "rating": 5, "body": "My family and friends love this pizza! I've made it several times, both as written and with adjustments, and it's always yummy and impressive-looking. If you want to save time, use the chopped roasted garlic in a jar, a Boboli-type crust and don't prebake the pears. Prebaking does have the advantage of drying the pears a bit, which can keep the crust from getting soggy. I've used goat's milk mozzarella before, which adds a little more tanginess. You can also make mini-sized pizzas and slice them thinly for an appetizer plate. Thanks for upping the creativity of my supper repetoire, Bostoncook!"}, {"name": "Elenchen", "rating": 5, "body": "I will definitely make this again. My only suggestion is to cut the pears in thin slices, probably skipping the pre-baking of them. Those chunks were definitely too big."}, {"name": "Gummibunny", "rating": 5, "body": "My whole family loved this dish, even my three year old. We will definitely make this one again!"}, {"name": "FITFreshNY", "rating": 5, "body": "I made this for an office party, and I was very nervous about pear on a pizza. I am new to cooking, and pears with prosciutto seemed beyond strange to me, but I figured I would try it to impress my new coworkers. I made one pizza as a tester, and it didn't last 20 minutes, between me, my boyfriend and his friend. It was excellent! I made two more pizzas to take to work, and everyone could not get enough! I even had to print out this recipe to give to a couple of women who were begging for it."}, {"name": "deedles", "rating": 4, "body": "Very excellent base recipe! Rated 4 stars instead of 5 for unnecessary prep time. \n\nI made a couple preparation changes which simplified and cut the time\n.\n1. Whizzed olive oil and raw garlic with stick blender, spread on pizza crust and skipped the pre-baking garlic step\n.\n2. Sliced pears thinly and skipped pre-baking them as well. They were nice and tender nonetheless.\n\nSubstituted feta cheese for the mozzarella, which gave a great tangy-ness against the sweetness of the pears. My 14 y/o daughter said \"this taste's awesome!\" and hubby said, \"you could open a restaurant with this pizza\". Will definitely make again with the above changes.\n\nThanks for the great idea, Bostoncook!"}, {"name": "chaela", "rating": 5, "body": "This pizza is soooo good! When first reading the ingredients, I didn't see how Swiss would be the right cheese for this pizza....but it was perfect. Making it again tonight!"}, {"name": "Lisa Marshall", "rating": 4, "body": "Interesting tastes and would make a nice appetizer - I didn't use mozzarella, though, and used Gorgonzola instead as I like a stronger flavor with the pears. I also didn't cook the pears ahead of time as mine were very ripe - I think if I cooked them ahead, they would have been too mushy. I'll definitely make this again."}, {"name": "Melissa Jurrens", "rating": 5, "body": "This pizza was AWESOME. I was invited to a fig, pear, and beet party so this was perfect. The best part was the goat cheese mozz I used instead of cow's milk mozz!!"}, {"name": "Sherry", "rating": 5, "body": "Delicious. The pear flavor is subtle but adds just enough sweetness to complement the other ingredients nicely. The roasted garlic in the crust is a nice touch. I used a Pillsbury refrigerated crust and did not preheat the baking sheet. Otherwise I followed the recipe as written."}, {"name": "ladychef", "rating": 5, "body": "This was really good, I liked the combination of salty and sweet. I thin sliced the pears, and I also raosted the garlic and cooked the pears at the same time in the oven. Will make again."}], "aggregateRating": {"ratingValue": "4.5", "ratingCount": 48}, "nutrition": {"calories": 618, "carbohydrate": 55, "cholesterol": 74, "fiber": 4, "protein": 31, "saturatedFat": 14, "sodium": 990, "sugar": 13, "fat": 31, "unsaturatedFat": 0}},
    {"url": "https://www.allrecipes.com/recipe/75975/pineapple-chicken-delight/", "category": ["Chicken", "Chicken Breast"], "title": "Pineapple Chicken Delight", "description": "This recipe tastes best with a Hawaiian style BBQ sauce, but if one isn&#39;t available, just use your own favorite. Every time I fix this, everyone LOVES it! There are usually no leftovers.", "ingredients": ["6 skinless, boneless chicken breast halves", "1 green bell pepper, sliced", "4 medium red potatoes, sliced", "1 (20 ounce) can sliced juice-packed pineapple, drained, juice reserved", "1 (18 ounce) bottle barbeque sauce"], "instructions": [{"type": "HowToStep", "text": "Preheat oven to 450 degrees F (230 degrees C). Lightly grease a medium baking dish.", "image": null}, {"type": "HowToStep", "text": "Place the chicken in the baking dish. Arrange pepper, potatoes, and pineapple around chicken. Pour the reserved pineapple juice over all, and top with barbeque sauce.", "image": null}, {"type": "HowToStep", "text": "Bake 1 hour in the preheated oven, or until chicken juices run clear and potatoes are tender.", "image": null}], "image": {"type": "ImageObject", "url": "https://www.allrecipes.com/thmb/j4fRpo2jUy-lKGv_0Ol7OgRmkWs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/876013-e955183ca3a14b36ae8b6613eb88a8c1.jpg", "height": 250, "width": 250}, "video": "No Video", "datePublished": "2019-04-02 02:46:41", "servings": 6, "cookTime": "PT60M", "prepTime": "PT15M", "reviews": [{"name": "abbyz2000", "rating": 5, "body": "My daughter had two helpings, she loved it."}, {"name": "angielynn4", "rating": 5, "body": "Awesome! Hubby and I loooved it. 11YO daughter enjoyed juicy, flavorful chicken breast. I didn’t have everything so here’s what I did: Seasoned chicken with Lion’s Tap seasoning blend and pepper, topped with a squirt of BBQ sauce. Used heavy syrup pineapple rings and juice (all I had). Sweet Baby Ray’s Original bbq sauce directly on chicken then piled veggies on top, next pineapple rings, poured on juice and lastly rest of bbq sauce on top of everything. Added carrot slices (fresh, thin slices) and onion slices. Omitted potatoes (didn’t have any). Let sit to allow sauce to thicken. Served over jasmine rice."}, {"name": "rearenfight", "rating": 5, "body": "Yumm! Super easy and delicious! Paired with Old Quarter Torrentes from Argentina."}, {"name": "Barbara", "rating": 5, "body": "Had this for the first time at my daughters. It is delicious. I followed the recipe to the tee. My husband is very picky and he had seconds so I think he enjoyed it."}, {"name": "Jeannie Driver Schrick", "rating": 5, "body": "This was delicious! I was looking for a super-easy, minimal-ingredients pineapple chicken, and this is it! I really piled on the potatoes, peppers and pineapple. I didn't marinade anything and it turned out just wonderful!"}, {"name": "Jane Livengood", "rating": 5, "body": "Thank you Joy for the great recipe. I was wanting to do something with Chicken and Pineapple. I added some jerk seasoning to the chicken for a little kick. the pineapple juice and the bbq sauce thickened up a made a great sauce."}, {"name": "MutherlyLuv", "rating": 5, "body": "I made this recipe for a large family gathering, several people had food sensitivities and this dish was PERFECT. Can easily be made gluten free and as long as you make sure your pineapple juice is 100% (no syrup added) it's pretty much perfect!\nI added carrots (yep, they taste great cooked in pineapple juice!) and added jalapeno to spice it up the second time I made it. :)"}, {"name": "La Toya Amos", "rating": 5, "body": "This is my second time making this dish and my family loves it just the same as the 1st time. The only changes I made was I seasoned my chicken legs and leg quarters with onion and garlic powder, ground pepper and creole seasoning before mixing in the bbq sauce and pineapple juice. Lastly I included some dark brown sugar in the mix .Great recipe, moist chicken sweet and savory!!"}, {"name": " Christine ", "rating": 5, "body": "Made it exactly as recipe said ,really really good and so easy to make . First time I have written a review but it was so good I had to !"}, {"name": "mel7124", "rating": 4, "body": "I love how quick and easy this dish is! It turned out delicious but next time I would omit the green peppers."}, {"name": "Sharon", "rating": 5, "body": "My family really liked this recipe. The prep is so fast. I used Sweet Baby Rays Hawaiian barbecue sauce. I did look at other reviews and microwaved the red potatoes for a few minutes prior to adding them to the chicken. The potatoes came out perfect. I will definitely be making this again."}, {"name": "Travis Knight", "rating": 5, "body": "Substituted orange juice for pineapple juice because we used a fresh pineapple. Marinated the chicken with about 8-10 ounces of orange juice, and half the bottle of BBQ sauce for an hour, then put the rest of the BBQ sauce on top of all the ingredients before putting it in the oven. A word of caution, we used a black pepper BBQ sauce, and it ended up being unfavorably peppery, so be aware. Overall, very delicious, would make it again for sure!"}, {"name": "Muffin Top", "rating": 5, "body": "This was really good. I can't believe how easy it was to put together and everyone loved it. (The second time I made it I left out the potatoes and served the chicken and sauce over coconut rice.) Thank you."}, {"name": "cookgardner", "rating": 5, "body": "HUGE hit and EXtremely easy. I did as suggested by others and cooked rice one the side instead of potatoes. Clean up was easy too!"}, {"name": "Keeli", "rating": 4, "body": "Simple, easy, basic good food. I left out the potato as I was serving the chicken with a roasted sweet potato and papaya salad. Dinner was delicious, but not something I would make again."}, {"name": "lindsey2712", "rating": 5, "body": "Loved this dish! Cooked according to recipe. Next time I will leave out potatoes and serve over rice. Excellent and easy!"}, {"name": "staceghost", "rating": 3, "body": "This did not take as long in the over as the recipe said."}, {"name": "Terie1", "rating": 4, "body": "This was so sweet and yummy! Will make again without the potatoes and peppers though."}, {"name": "raffaeli15", "rating": 4, "body": "This recipe was awesome! The only thing I added was salt and pepper to the chicken before adding the pineapple and BBQ. Despite the limited amount of ingredients and simplicity I was pleasantly surprised by the great flavor. I loved the potatoes (had to slice them very thin) and bell pepper with this. Will be adding this to my repertoire of recipes."}, {"name": "Lila", "rating": 5, "body": "Just made this last night. So good chicken was soooo tender and flavors meshed well together. Added red onion instead of green and also sliced onions."}, {"name": "lisad", "rating": 5, "body": "I tried this recipe a few different times. I thought that the oven temp would be better for bone in breast so thats what i tried first. It was awesome! However i did microwave the potatoes a few minutes before slicing them and used only half the pineapple juice. I also added red onion and mushrooms. My husband perfered to try it with boneless breast. After a few failers i managed to get it right only it took alot longer than 1 hour. I tried tasting the chicken after 1 hour and it was tough. I used the whole can of pinapple juice this time and it was still watery. I continued to cook it at 450 to thicken up the sauce. I had a rotisseri chicken in the fridge as a back up. About a half hour later the potatoes were tender and the sauce was thicker and to my surprise the chicken was even tender! My husband and my 25y/o son loved it!"}, {"name": "Melynda Downing", "rating": 5, "body": "picky eater hubby loved this dish!!!!! said the best dish I've ever made. made tonight for a 2nd time. I did follow other suggestions and put foil down on bottom of pan first and sprayed it and put extra pineapple juice and used sweet baby rays honey bbq sauce."}, {"name": "dropsofjupiter", "rating": 5, "body": "I made this tonight and it was a big hit! so easy and very tasty, served with rice, peas and corn. I added brown sugar soy sauce and worch. sauce to the pineapple juice (used to cans) to give it an Asian flare, than drizzled barbecue sauce and a hot and zesty marinating sauce over the chicken! it was so yummy! Kids loved it! :) Thanks for sharing this wonderful recipe!"}, {"name": "Cathy", "rating": 5, "body": "Tried it twice. It turned out perfect the first time and we loved it. The second time the potatoes never softened and I cooked it a half hour longer to try and get them softer but no luck. Not sure why but it still tasted good."}, {"name": "gfitzpatrick", "rating": 4, "body": "Successful! I think it would take approximate 45 minutes of baking. Potatoes and chickens were completely done within 45 mins. Potatoes would become burn if I decided to bake for an hour. I think it is depending on what kind of stove we have. I enjoyed this dinner! I would love to eat it again. Many thanks for your recipe!"}, {"name": "Sue Taylor", "rating": 5, "body": "Yummy and easy! What could be better than that? I was reluctant to include the potatoes, but they were great. I added baby carroh which I highly recommend. I only had a small can of pineapples, so added a small can of mandarin oranges along with its sauce and that worked well too. Loved the combo of fruit juices with the BBQ sauce!"}, {"name": "sarahm92", "rating": 5, "body": "I am newly married and attempting to cook delicious meals for my new hubby. This was such an easy recipe - I figure anyone can do it! Now my hubby refers to me as an awesome cook and I didn't even have to go through any hassle to make him an amazing meal! Plus, we both LOVE pineapple! I made it for my family and they really enjoyed it. It's so true that the pineapple &amp; juice makes the chicken SO tender. 1 time I was out of pineapple and just used OJ. Still wonderful but would prefer the original recipe. You can add so many things though: potatoes, onions, carrots, or bell peppers (capsicum). I HIGHLY RECOMMEND!!!"}, {"name": "jillywilly", "rating": 5, "body": "Awesome! And so easy! I added some onions to it also and a can of crushed pineapple. And new baby potatoes. My husband raved about it. Also good with pheasant."}, {"name": "Joy Underwood", "rating": 5, "body": "I just want to thank everyone for the comments on this recipe. I have enjoyed reading your reviews, and so glad to hear that each meal was a success. It's one of my favorite dishes to fix. And, by the way, you can use whatever parts of the chicken you wish, the editor of this site is the one that put chicken breasts on there. I usually use leg quarters. But it depends on whose eating it, as to what I use (some people prefer white meat to dark). You might could even venture to try other types of meat such as pork or beef. If anyone tries it and likes it, please let me know.\r\n\r\nHappy eating! :)"}, {"name": "melissa", "rating": 5, "body": "So delicious! A new family favorite! I doubled the amount of peppers, potatoes and pineapple. I added one sliced onion (thanks for the tip!) and extra BBQ sauce. It was perfect. The next night I had some chicken left but not a lot of sauce and veggies. In a heavy pot, I put in onions, peppers and potatoes. Since I only had a couple of pineapple slices, I used some of my kids' fruit cups- 2 peaches and one fruit coctail. I topped it off with more BBQ sauce and heated it for an hour. It was just as good! This was a hit! THanks!!"}, {"name": "TINAMAY1", "rating": 5, "body": "Easy and delisious, used regular potatoes and yellow peppers."}, {"name": "Keashia", "rating": 5, "body": "This recipe was surprisingly good! Didn't think I would like pineapple and chicken but since I was looking for something new, I decided to try it anyway. It had the house smelling yummy after only two minutes in the oven. My daughter loved it and so did I. Can't wait to try it out on my husband when he gets back from his deployment. Thanks for a wonderful recipe."}, {"name": "Jill", "rating": 5, "body": "WONDERFUL! I loved this recipe! The only change I made was I used a can of whole potatoes instead of slicing red potatoes. For the BBQ sauce I used Sweet Baby Ray's Sweet ’n Spicy. Next time I might try using fresh green beans instead of a green pepper just to see how that would taste. Overall a wonderful, easy recipe! Thanks for sharing!"}, {"name": "Amymee", "rating": 5, "body": "I'm a new to cooking and I've always been a little afraid to cook chicken for some reason so this was a perfect starter recipe for me. I made this for a group of people one night for dinner and everyone loved it! The chicken turned out so juicy and the BBQ sauce complimented the pineapple juice perfectly. I'm actually making this again tonight. So good."}, {"name": "Karen CS", "rating": 5, "body": "This was absolutely excellent! My husband loved it too. I made a couple of changes and used Red Garnet yams (sliced fairly thin) in place of potatoes, and red bell peppers in place of the green peppers. For the barbeque sauce I used original Sweet Baby Ray's, and pineapple tidbits instead of slices. It was really great served with rice cooked in chicken broth with lots of sauteed celery in it. I wish I had taken everyone's advice about lining the pan with foil! :) Next time for sure!"}, {"name": "DanielleLyn", "rating": 4, "body": "This was a scrumptious dish! It does sound weird pairing potatoes with pineapple and bbq sauce, but it worked! I loved the sauce on the potatoes and chicken! My husband loved the pineapple chunks in it, but for me I think they clashed a bit eating them along with the potatoes. So I just ended up giving all the pineapple to my husband and he gobbled them up. I do think next time I will add in sliced onion and another potato....maybe omit the pineapple chunks or put them on the side for hubby! The first 30 minutes I left the chicken out and covered the dish with foil to help cook the potatoes faster. Then the last 30 minutes uncovered and added the chicken to cook. Doing it that way, it didnt risk over cooking the chicken and making it tough, and it made the potatoes perfectly cooked even being sliced into normal sized chunks. It was perfect at that high of heat, and made the sauce nice and thickened. I served this with a side of rice. Thanks for the great recipe! I will be making again!"}, {"name": "Scottie", "rating": 5, "body": "I have done this once and now again. I love it and I am gonna make it for my parents this Easter weekend. Perfection."}, {"name": "Trish Megyesi", "rating": 3, "body": "The chicken was very moist and fell apart. The flavor profile was not to our liking. Almost a creole flavor. Maybe I used the wrong barbeque sauce. There are so many variants on the market maybe more specific guidance would be helpful. This was only OK..."}, {"name": "Nikki", "rating": 5, "body": "This is my first review, I just had to say how AMAZING this recipe is. I make it almost every week. It's one of my favorite dishes I've ever had in my life and my bf loves it! I dice the potatoes small and heat them in the microwave with some water for 4 mins before so that they aren't hard, and I dice green pepper and red onion, but don't add until the last 20 mins of cooking or they get too soft. I use Diana Sauce for Ribs and Chicken and it with the pineapple is perfection. When I'm low on bbq sauce I add teriyaki sauce and spices to the bbq and it is great like that too. You can experiment with your type of potatoes and veggies, and even adding nuts os great. You must try this!!"}, {"name": "stacy", "rating": 5, "body": "Excellent recipe! Yummy and so easy! I sauteed an onion and added that only because I had time. (I will definitely add an onion every time, though, I just may not sautee it every time.) I followed other suggestions and sliced the potatoes fairly thin and they cooked perfect."}, {"name": "amd3630", "rating": 5, "body": "just made this recipe tonight and it is AWESOME!! Its a symphony of flavors in your mouth. Very simple to make, esp if your not a very good cooker(like me). this is going into my cookbook"}, {"name": "japktp", "rating": 5, "body": "I tried this recipe months ago and now we have it at least once a week. It's so easy and delicious!\nI just pick up a bag of frozen chicken breasts, defrost them, put them in a pan and cover them with pineapple chunks and a bottle of barbecue sauce and bake them at 375 for 45 minutes if I don't have time to add the veggies :) \n Never fails to be fantastic!"}, {"name": "Cindy in Pensacola", "rating": 1, "body": ". The chicken was way over done and the potatoes weren't soft."}, {"name": "kristyearl", "rating": 5, "body": "This was delicious. I followed the instructions (except for adding the pepper, and we used and we used pineapple chunks), except I scaled down everything because I'm only feeding two. My husband is super picky and he loved it. The sauce came out a little thin, but it was delicious."}, {"name": "Allrecipes Member", "rating": 5, "body": "This was delicious. I followed the instructions (except for adding the pepper, and we used and we used pineapple chunks), except I scaled down everything because I'm only feeding two. My husband is super picky and he loved it. The sauce came out a little thin, but it was delicious."}, {"name": "Kathleen O'Donnell Porter", "rating": 4, "body": "This was delish! My husband said \"The sauce in this is great!\" I did as one reviewer stated and lined my dish with tin foil. That was a great idea. Will have this again."}, {"name": "Othel Chase Jr.", "rating": 5, "body": "Absolutely fantastic!!! I really don't understand why everyone hasn't rated this 5 stars. Thank you so much!"}, {"name": "thmpsn_gwn", "rating": 4, "body": "This recipe was really good...it was nice to find a recipe that the whole family enjoyed. We just had it last night and our son already asked when we're having it again. I made the chicken and served it over rice...so simple and so yummy. Thanks ;)"}, {"name": "rucookin'", "rating": 5, "body": "Made this for dinner this evening and the entire family enjoyed it. I added half an onion and put the veggies on top of the chicken since I didn't have space around the chicken. I didn't have potatoes so I served over rice which was great with the sauce."}, {"name": "Christy", "rating": 5, "body": "This was so easy and soooooo good! Loved it, as did everyone in my family. I make it almost every week."}, {"name": "meredithleigh3", "rating": 5, "body": "My Husband could not stop raving about this. I used 4 large chicken breast and Honey Mustard BBQ sauce. I cooked it for an extra 15 minutes b/c the chicken was so thick. I also let the meal stand for 10 minutes or so so the juices would thicken. There is barely any clean up and I was finished prepping it in 10 minutes!! SSSHHH...don't tell my husband that :)"}, {"name": "Anna Paszkiet", "rating": 5, "body": "This was absolutely delicious. I microwaved the potatoes for 4 minutes before I sliced them and they came out perfect. You also need to season the chicken with basic salt and pepper to get a little more flavor."}, {"name": "antigoneargyriou", "rating": 5, "body": "EVERYONE loved this - even my mother who is the pickiest eater! When I saw her clean her plate and head for seconds- I was in shock!!! This is delicious"}, {"name": "Allrecipes Member", "rating": 5, "body": "EVERYONE loved this - even my mother who is the pickiest eater! When I saw her clean her plate and head for seconds- I was in shock!!! This is delicious"}, {"name": "Lindsay Anderson", "rating": 4, "body": "Easy and yummy. My five-year-old loved it, which for me, is always a huge bonus. (So did my 11 month old, but she'll eat anything!) I thought the potatoes, which I sliced VERY thin, were just a TINY bit undercooked, and I didn't love them coated in BBQ sauce, so next time I might just do them separately or make some rice instead. But the flavor of this was quite tasty and the chicken was moist and delightful."}, {"name": "starlitwishes", "rating": 5, "body": "Excellent. Made it just as written except I used red instead of green pepper, and pineapple chunks instead of rings. Turned out perfect...had no problems with the potatoes cooking..they came out just right!"}, {"name": "Hanna R", "rating": 5, "body": "We loved this recipe at home... I made a few changes to it. Instead of using green peppers I made it with red peppers, added some carrots, potatoes, and pineapple chunks- I stuffed a whole chicken with the veggies and slow cooked it in the oven for a few hours... it was awesome! Thanks."}, {"name": "Rory and Max's Mommy", "rating": 4, "body": "Fantastic recipe... what a great combination of flavours. My only comment would be to boil the potatos a little before cooking just to soften as they were quite hard. Will definitely use again."}, {"name": "SUNSHINE6420", "rating": 4, "body": "I would have given it 2 stars but my mom liked it so I'll go with 4. It was way too sweet for my taste (and I used an original flavor BBQ sauce-one that was not sweet to begin with). I can't imagine what it would taste like with a sweet BBQ. I felt like I was eating potatoes with syrup on them, quite gross to me. But, like I said, my mom really enjoyed it--enough for seconds. It is an easy recipe and I just threw everything in a baking bag (baked the potatoes for 30 minutes first then added the chicken and green peppers and cooked about 30 more minutes). Very easy but not suited to my taste...perhaps with some chili pepper in it..."}, {"name": "kellieann", "rating": 5, "body": "Easy and delicious!"}, {"name": "amorelle615", "rating": 5, "body": "Absolutely delicious!! Didn't have bell pepper on hand, so I just used onion instead. Also, used honey BBQ sauce and pineapple chunks! Hubby and children loved it. Will make again!! Thanks!"}, {"name": "Beth H", "rating": 3, "body": "My husband liked this, but I wasn't impressed. I didn't have green peppers, so I added carrots instead, and added extra pineapple as some other reviewers recommended. Still, I thought the BBQ sauce overpowered the pineapple, and that's all I tasted. I doubt I'll make this again as there are better 'Hawaiian Chicken' type recipes out there."}, {"name": "Tamara", "rating": 3, "body": "The veggies were great, but the chicken didn't absorb much flavor even though I marinated it in juice and sauce as recommended. Also, I sliced the potatoes thin, but still seemed to overcook the chicken before the potatoes were done."}, {"name": "cookin' momma", "rating": 4, "body": "My family really enjoyed this dish. I was a little nervous about combining all of the pineapple, potatoes, bell peppers and bbq sauce. I didnt think it sounded to good but after I read the reviews I decided to give it a shot. I thought it was very flavorful and I loved how the chicken turned out so tender and moist. The pineapple and the bbq sauce gave it just the right... ZING! My family and I agreed that we didnt care to much for the potatoes being cooked along with the other ingredients. So, next time I am going to serve the chicken over mashed potatoes as one reviewer had already mentioned. You could also serve it over rice if you want. I also thought that I might marinate the chicken in the pineapple sauce for a little while. It just added such a good favor to the chicken the first time. I think marinating it longer would make it even better. The cooking time was perfect. I took the advice of other reviewers and lined my pan with tin foil. But, before I did that I also sprayed the pan with cooking spray..BOY AM I GLAD I DID! It still leaked through the foil some, but because I had sprayed the pan previous the clean up was no big deal.\nIf you are looking for a dish that is different and pretty darn tasty then give this one a try. I will be adding this to my recipe box for sure. Thanks for the recipe!"}, {"name": "Jackie Clonan", "rating": 5, "body": "IF I COULD GIVE THIS 10 STARS I WOULD. AS THE KIDS SAY, OMG...THE BEST MEAL I HAVE MADE/EATEN IN AGES, &amp; I'M AN AVID/EXPERT COOK! MY HUSBAND, WHO NEVER LIKES SWEET WITH SAVORY, PROBABLY COULD HAVE EATEN IT ALL...&amp; I USED 8 SKINNED THOUGH BONE IN THIGHS [OUR FAVORITE]. I'M A LITTLE EMBARASSED TO ADMIT WE FINISHED IT ALL! SOOOOOOOOOO GOOD, REAL SOUTHERN COOKED COMFORT FOOD!!!\nJUST A NOTE: WE DON'T CARE FOR PEPPERS, &amp; I HAD SEVERAL SHALLOTS, SO I PUT THEM IN. ALSO, LIKE OTHERS, THE THINLY SLICED POTATOES WEREN'T FULLY COOKED, SO I PUT THE LID ON FOR THE LAST HALF HOUR OF COOKING....TOTALLING 1-1/2HR. COOKING TIME [SINCE I USED DARK MEAT, &amp; DOUBLED THE AMOUNT]. I COULD NOT BELIEVE HOW THE SAUCE THICKENED AS WELL. APPARENTLY THE WORDS WRITTEN ON MY KITCHEN WALL ARE TRUE....COOKING IS LOVE MADE VISABLE! THANK-YOU JOY!"}, {"name": "Amy W.", "rating": 4, "body": "I really enjoyed this recipe. I added onion and carrots to mine and it was just excellent. My husband really enjoyed it. He's not into carrots and peppers but he really liked them in this dish. It was so simple to make and I will definately be making it again!"}, {"name": "EBLUE7", "rating": 2, "body": "it was very easy, and the hint about lining the baking dish was incredibly helpful, but this dish was too sweet for my taste. i would've liked a little more flavor to the chicken."}, {"name": "~TAYLOR~", "rating": 5, "body": "I decided to try this recipe based on my pal KOALAGIRL's recommendation, and I'm so glad I did!!!! I have to concur with her review. AWESOME! Yes, line your pan with foil, slice those 'taters as thin as you can and IMHO, double up on the amount of pineapple juice or all you're going to taste is chicken in BBQ sauce.I've made this twice in two weeks and the hubby and kids are still licking their lips. This \"easy-pleasey\" recipe's going into our rotation for sure. Thanks Joy!"}, {"name": "KOALAGIRL", "rating": 5, "body": "10 STARS! This is awesome! I used chicken thighs instead of chicken breast, but otherwise followed the recipe accordingly. Baked at 375 degrees for one hour. Even though I lined my baking pan with foil, it still leaked and I see 3 days of soaking ahead. But who cares! This dinner was absolutely wonderful -- causal company worthy! I served with mashed potatoes because we had no red taters. Homey, comfort food! You have got to try this one, folks!"}, {"name": "Heather", "rating": 4, "body": "This was great! The juices from the pineapple and the bbq sauce really kept the chicken moist. I thought the temp and time were too high and too long so I lowered both and I wish I had just listened to the recipe. I kept turning up the temp and I left it in for over an hour! Thanks for the great recipe :-)"}, {"name": "mewbornej", "rating": 5, "body": "AWESOME!! We make this meal at least once every two weeks. The combo between the BBQ sauce, pineapple and pepper is fantatic. We did up the amount of peppers, potatoes and pineapple in the mix. Use two cans of pineapple for the juice, may not use all the pineapple.\n\nGreat over white rice!"}, {"name": "linda", "rating": 5, "body": "Great easy recipe.....throw together and it's done. My type of recipe. Oh yes, the family loved it."}, {"name": "Becky", "rating": 4, "body": "Everyone liked this"}, {"name": "IVORYQUEEN", "rating": 3, "body": "I modified this recipe according to other reviewers' suggestions: I left out the potato and peppers; I let the chicken marinate in the pineapple juice and BBQ sauce for about an hour before cooking, and I cooked the dish for 40 mins at 425. \nI prepared white rice as a side dish, and it was a great compliment. I will make this again, but next time I will use less pineapple juice. I would have liked the sauce left in the pan to be thicker.\n\nOverall, this is a simple, quick prep recipe, using pantry items that I almost always have.\n\nI am also stingy with stars :)\nThank you for sharing!"}, {"name": "Amber Smithson", "rating": 5, "body": "My husband and I really enjoyed this recipe! I cut it in half (except for the pineapple), and instead of placing the veggies around the chicken, I layered everything together in a casserole dish. Make sure you THINLY slice the potatoes so they are sure to be cooked. It turned out beautifully!"}, {"name": "Jackie", "rating": 5, "body": "This was amazing! I definitely recommend it."}, {"name": "mollieo924", "rating": 5, "body": "DELICIOUS! I also lined my pan with foil for easy clean-up and it worked out nicely. What a great and simple to put together dish! LOVED it!"}, {"name": "busymommy", "rating": 4, "body": "This recipe gets points for ease. I had all of the ingredients on hand. I used baby yellow and red bell peppers instead of the green and I omitted the potatoes. (I served this with rice balls) It was good, the kids liked it, but at the end of the day it was just chicken with barbecue sauce and pineapples poured over it."}, {"name": "Lisa J", "rating": 5, "body": "I read a variety of reviews before trying this recipe, and I've made a few modifications myself as well. I've made it three times now, once for a dinner party, and it has been very well received every time. I add a bit of soy sauce, Worcestershire, and white vinegar to the sauce, and reduced the pineapple juice. I add the vegetables only for the last 15 minutes of baking because they could, indeed, be soggy and overcooked if they sat in the sauce for the whole hour. Oh, and I marinate the chicken in the sauce for 24 hours before cooking. In any case, my family and friends and I LOVE this recipe! It's easy and delicious; I highly recommend it!"}, {"name": "Yumyum", "rating": 5, "body": "This recipe was absolutely amazing! I loved every bite. I cut the chicken into 2\" pieces, used pineapple chunks, and used red pepper, green pepper, and onion. The sliced red potatoes had a great taste with the bbq sauce. My husband and I both loved it! I will definitely make again. Simple and delicious!"}, {"name": "patricia0807", "rating": 5, "body": "This receipe was delicious. I used fresh pineapple and omitted the vegetables. and my family just loved it. Definitely would make this again."}, {"name": "ashley", "rating": 5, "body": "i make this every other week, my husband makes me. its so good! we dont have an over so i make it on the stove: slice two chx breasts into chucks and cook over medium heat in the pineapple juice and 1/4 bottle bbq sauce. i another pan i sautee the green pepper (sliced) and pineapple (sometimes i add 1/2 and onion, sliced). after chx is fully cooked i add the saute' to the chx and cook covered over low heat another 5 minutes or so. i leave out the potatos, as we're always too full off the chicken anyway :). so so good!! thanks"}, {"name": "VTmom", "rating": 5, "body": "I made this for dinner last night since I had taken chicken out of the freezer and didn't know what to do with it! I had everything on hand and it was great! The only changes I made were to use 3 pounds boneless, skinless thighs, 2 green peppers, and about 1 cup of BBQ sauce instead of the whole bottle since one of my sons does not care for BBQ sauce. The result, the sauce was a bit thin but over rice this was a hit with the whole family. The pineapple juice makes the chicken so tender! We are actually happy to eat the leftovers tonight!"}, {"name": "Pam Sylvia Zotter", "rating": 3, "body": "This was quick and easy...chicken comes out tender from pineapple juice, tastes like sweet barbeque chicken...maybe cut back on the barbeque sauce. But I can't say it was phenominal. I agree with another rating that says it would be better with different cuts of chicken. It worked in my limited pantry night pinch. Thank you for the suggestion!"}, {"name": "Valerie Brunmeier", "rating": 4, "body": "This turned out really well. I served this with potatoes on the side so I omitted the potatoes in the dish and instead added sliced onion. I reduced the oven temp to 425 but followed as written otherwise. The result was very good. I think it would also be good with different cuts of boneless chicken (thighs, bone-in breasts)."}, {"name": "VSW30", "rating": 4, "body": "I tried this because a friend of mine said it was terrific. My family and I also liked it.However, I would make some changes next time. I would leave out the green pepper and the pineapple pieces- after an hour of cooking time, they were very very soggy, we didn't like the texture of it. The overall flavor was wonderful. The chicken was so tender and moist, we cut it with a fork! All in all I would make this again."}, {"name": "Lana1522", "rating": 5, "body": "Amazing! Very Simple and Easy to cook. I loved the combination of BBQ and Pineapple. I added more pineapple juice than recommended because i could never really taste the pineapple as much as i would have liked. It also didnt take me an hour to cook. It only took me 40mins so keep a look out to make sure they dont over cook. Thanks so much for posting the recipe. Its our new favorite dinner!"}, {"name": "Cathy G.", "rating": 5, "body": "I cut the recipe in half for the two of us and it made a very nice dinner. I followed another reviewer's suggestion and foil lined my pan and I also par boiled my chunky potatoes before adding. I topped with just 3 rings of pineapple since I am not a fan of cooked pineapple but the barbecue sauce on this made it so delicious. The chicken turned out moist and flavorful, and l hr on 400 was plenty, husband ate more than his share. Make sure you use your fav barbecue sauce because that makes all the difference."}, {"name": "LHayden", "rating": 5, "body": "WOW, what a wonderful recipe! I followed exactly as posted. It was excellent! Definitely won of my favorites!!!!!!!!"}, {"name": "Francine L.", "rating": 1, "body": "I hate to be the one to say this. But I feel that it's necessary. My entire family did not care for this. I fought with my children to eat this, and my husband said \"well at least our stomachs will be full\". I think I'm a pretty good cook, but it just tastes like cooked chicken and potatoes with a bottle of barbeque sauce dumped on it. That's it. No offense to the seemingly nice lady who submitted the recipe. It just did not suit our taste. P.S. I followed the directions as is and did not make any alterations."}, {"name": "Miss Kris", "rating": 4, "body": "I will make this again, pretty tasty! I used chunk pineapple and probably would have added more than one can as I really liked the pineapple flavor. You definitely need to bake/parboil your potatoes. I microwaved mine a little thinking they would finish cooking with the rest of the ingredients but they were hard as a rock... we put them back in the oven for at least another hour. Hubby loved it, will make it again."}, {"name": "Stephanie Bader", "rating": 4, "body": "This turned out really well, all my roomates ate it right up. At first they were kind of put off by the ingredient list but after they tried it they really liked it. The only reason i don't give it a five is because no one said \"Wow\" and I'm stingy with 5's."}, {"name": "iloveonions", "rating": 4, "body": "I had half a rotisserie chicken to use and didn't have time for the oven, so I modified it for the stovetop, and it turned out beautifully. I started with sauteed peppers and onions. Then I cooked the potatoes separately (20 minutes in boiling water), shredded the chicken, and cooked it all in the barbeque sauce and pineapple. Was ready in less than 30 minutes and tasted great."}, {"name": "Sandi S.", "rating": 5, "body": "This is a fantastic recipe which I made today for the first time. It was a big hit with my family. I used masterpiece brown sugar barbecue sauce and also added some frozen sliced carrots. The aroma from the oven was heavenly. I can't believe something so easy could taste so wonderful. As my husband said during dinner, \" This meal is a home run\"."}, {"name": "DJ", "rating": 5, "body": "this was awesome!! i added onions and i used yukon potatoes instead of red. i sliced them extra thin so they would definitely finish cooking. this really was great..so great my boyfriend went back for THIRDS!! he ate until he felt sick!! if i can offer one tip...PLEASE LINE your baking dish with foil!! i made this 3 days ago and i'm still soaking my pan!!! it's worth it though!"}, {"name": "GIRLYHOME1", "rating": 4, "body": "this was easy and good, will definitely make again and again, we loved it! \n\nbut i would suggest par boiling the potatos or just leaving them out b/c my potatos were thin sliced and came out crunchy, but the chicken was cooked perfectly (i also left out the green pepper)."}, {"name": "Proud Army Wife", "rating": 5, "body": "WOW!!! This is one of the easiest and most delicious recipes I've ever tried. As others mentioned, it smells wonderful while cooking. I used brown sugar BBQ sauce and I didn't have any red potatoes, so I threw in a package of frozen mixed baby potatoes and other veggies, and it turned out much better than I expected. The chicken was very moist and just peeled apart. Thank you for this recipe!"}, {"name": "bautery", "rating": 5, "body": "This recipe is super easy and delicious!"}, {"name": "Thisni Caza", "rating": 3, "body": "Review of this recipe is mixed. But maybe it is me?? I followed the ingredients exactly, kind of: chicken tenders instead of breasts; pineapple tidbits instead of slices; white potatoes for red. I thought 450 for one hour was too high for too long, but didn't see the time and temp mentioned in any other reviews, so went for it. The green pepper was way overcooked; the potatoes were not done. I removed the green pepper and chicken and returned the potatoes to the oven for another fifteen minutes. I may have cut the potatoes too thick. The potatoes were barely done. The sauce was way too acidic. I liked it, but it gave me a tummy ache. And, was the dish supposed to be covered or uncovered? The recpe didn't say. I started with what I would consider a larger casserole than the medium size indicated, and the covered casserole boiled over in the oven. (I was not surprised at 450!) I removed the cover about half-way through. I want to try this again, but next time with less pineapple juice, maybe half, parboiled potatoes, and a lower temp. And I will add the green peppers for the final twenty minutes or so."}], "aggregateRating": {"ratingValue": "4.4", "ratingCount": 148}, "nutrition": {"calories": 743, "carbohydrate": 90, "cholesterol": 67, "fiber": 4, "protein": 32, "saturatedFat": 9, "sodium": 1358, "sugar": 24, "fat": 28, "unsaturatedFat": 0}},
    {"url": "https://www.allrecipes.com/recipe/234851/pigs-in-a-paleo-pouch/", "category": ["Sausage", "Pork"], "title": "Pigs in a Paleo Pouch", "description": "Pigs in a blanket are given the paleo treatment in this twist on the classic where eggs are &#39;wrapped&#39; in a sausage blanket.", "ingredients": ["2 teaspoons salt", "2 teaspoons dried sage", "1 teaspoon ground black pepper", "0.125 teaspoon ground turmeric", "0.125 teaspoon dried marjoram", "2 pounds ground pork", "1 tablespoon butter, or more as needed", "8 eggs"], "instructions": [{"type": "HowToStep", "text": "Stir salt, sage, black pepper, turmeric, and marjoram together in a bowl. Place pork in a separate bowl. Sprinkle salt mixture evenly over pork and stir to combine. Cover with plastic wrap and refrigerate for at least 8 hours or overnight.", "image": null}, {"type": "HowToStep", "text": "Preheat oven to 350 degrees F (175 degrees C). Butter eight 8-ounce ramekins.", "image": null}, {"type": "HowToStep", "text": "Divide sausage mixture into 8 balls. Press each ball into a ramekin, creating a well in the center of each. Crack an egg into each sausage well.", "image": null}, {"type": "HowToStep", "text": "Bake in the preheated oven until sausage is cooked through and eggs are set, 30 to 40 minutes.", "image": null}], "image": {"type": "ImageObject", "url": "https://www.allrecipes.com/thmb/VpXiw_gFE8DZNgkHlCSfXnmqrlI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/3160477-2e2b5e95eb444014839623348c8efde1.jpg", "height": 960, "width": 960}, "video": "No Video", "datePublished": "2018-06-08 10:10:45", "servings": 8, "cookTime": "PT30M", "prepTime": "PT10M", "reviews": [{"name": "France C", "rating": 4, "body": "These are great and perfect for my Keto way of eating. I was looking for a quick breakfast I could take to work with me. These actually reheat really well! I made a half batch since I live alone. Mine ended up taking the full 40 mins. Even at 40 mins they were slightly soft, but how I like them. I packaged them up in individual plastic containers and each morning I grab one for work. I reheat them on 50% power for 1:45. I will be making these again, tweaking the seasonings slightly. They've very versatile."}, {"name": "Baking Nana", "rating": 4, "body": "We really liked these. I did not use the sausage recipe, as I had breakfast sausage from pork we had processed. \n20 minutes if you want the yolk a bit runny or 30 for a firm egg. A pretty tasty breakfast treat."}, {"name": "chd", "rating": 3, "body": "ok"}], "aggregateRating": {"ratingValue": "3.8", "ratingCount": 4}, "nutrition": {"calories": 318, "carbohydrate": 1, "cholesterol": 263, "fiber": 0, "protein": 27, "saturatedFat": 9, "sodium": 719, "sugar": 0, "fat": 23, "unsaturatedFat": 0}},
    {"url": "https://www.allrecipes.com/recipe/157433/lengua-beef-tongue/", "category": ["Latin American", "Mexican"], "title": "Lengua (Beef Tongue)", "description": "Beef tongue is boiled with garlic, onion, and jalapeno peppers before being thinly sliced. This beef tongue takes a little time to prepare but is very tasty served in some warm corn tortillas.", "ingredients": ["1 beef tongue", "1 large onion, chopped, divided", "2 cloves garlic", "3 tablespoons salt", "1 whole jalapeno pepper, stemmed", "3 whole tomatoes", "2 whole jalapeno peppers, stemmed", "2 tablespoons vegetable oil"], "instructions": [{"type": "HowToStep", "text": "Place the tongue, half of the chopped onion, garlic cloves, 3 tablespoons salt, and 1 jalapeno pepper into a large pot. Fill with water to cover the tongue by several inches, then bring to a boil over high heat. Reduce heat to medium-low; cover and simmer until very tender, 3 to 4 hours. Remove the tongue from the water and allow to cool. Reserve the liquid. Once the tongue has cooled, peel off the tough outer skin, then shred the meat using two forks.", "image": null}, {"type": "HowToStep", "text": "Bring a large saucepan of water to a boil over high heat. Add the whole tomatoes and 2 jalapeno peppers; boil until the vegetables are tender. Place the vegetables into a blender, and puree until smooth. Heat the vegetable oil in a large skillet over medium heat. Stir in the onion, and cook until the onion has softened and turned translucent, about 5 minutes.", "image": null}, {"type": "HowToStep", "text": "Once the onion has softened, stir in the shredded beef tongue and tomato salsa. Bring to a simmer, stirring occasionally, then pour in 2 cups of the reserved cooking liquid. Cook and stir until the liquid has evaporated, leaving moist, flavorful meat, about 20 minutes.", "image": null}], "image": {"type": "ImageObject", "url": "https://www.allrecipes.com/thmb/WsuyzxeT3RndC6SeNnO6FSm42DU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/573759-7d6c92fef82a435aa2d25ceb38748371.jpg", "height": 250, "width": 250}, "video": "No Video", "datePublished": "2018-06-08 09:49:59", "servings": 16, "cookTime": "PT205M", "prepTime": "PT15M", "reviews": [{"name": "Johnny Espinosa", "rating": 5, "body": "I have made tongue many times but cooking it down with the salsa made it a family favorite. We don’t like very spicy food so I removed the seeds from the jalapeños before boiling them. Great flavor with very little heat."}, {"name": "MelissaScott", "rating": 5, "body": "My husband and step-dad LOVED this recipe! Taking the membrane off took more work than I thought, but was still not bad to do. We made them into tacos using corn tortillas and served with a side of rice. My kids thought it tasted like pork and we ate it all up. Thanks for the recipe!"}, {"name": "Sugar Momster", "rating": 5, "body": "I grew up with my grandma and mom adding raisins to sweeten their lengua but I prefer this traditional taste over the sweet any day. My man cringes at what it is and my son knows what it is and loves it! It's totally worth the time and effort to make. I'm going to try and make a small batch of enchiladas with it."}, {"name": "Felecia1331", "rating": 5, "body": "Taste is great, my issue is the texture of the meat, but I don't think that has anything to do with the recipe. Very good."}, {"name": "ladybuggs5224", "rating": 5, "body": "This was a really good recipe. I didn't change anything other than cooking mine just a bit longer since it was on the larger side. I served it on soft fried corn shells =)"}, {"name": "Jeeplette", "rating": 5, "body": "I remember wrinkling my nose when my mom used to get lengua on Sundays. Once I tried it, that was a different story.\nCooking method only: This recipe makes an awesomely flavorful lengua (beef tongue)! I thought the amount of salt seemed like too much, but it is perfect. \nI didn't have any jalapeno peppers but I did add some celery to make a wonderful broth (now I have tons of yummy beef broth in my freezer for future use!!).\nI also cooked it in the crockpot for about 8 or 9 hours on low heat.\nI only followed direction #1 because I needed the meat to be drier to make into gorditas (my recipe uses different liquid/spices). I can't wait to serve this to my family! They are going to love it (I wonder how they are going to react when I tell them what it actually is...lol).\nI have no doubt that they will still ask for it again and again!"}, {"name": "birketaustin", "rating": 5, "body": "seriously awesome. the hardest thing about this recipe was finding a place to buy the tongue!"}, {"name": "Hibiscusita", "rating": 5, "body": "This is delicious! So tender and tasty. I've made your recipe at least four times in the past couple years, usually for tamales. After the tongue's done simmering, I just add sauteed onions and spices like cumin, onion, and garlic powder. Any tips on how to use the leftover spicy salted beef broth? I have so many containers of it in my freezer!"}, {"name": "bog5nc", "rating": 4, "body": "I cook it over night in a crock pot. It comes out super tender in the morning (8-9 hours on low)!!Boil it with a small onion, jalapeno, serrano, tomato, a couple of bay leaves, salt, garlic salt, bouillon. Make sure you add plenty of salt to the water that way the meat can have a lot flavor. Shred and serve in tacos."}, {"name": "kat", "rating": 5, "body": "I thought cooking tongue was harder than it was. The skin came right off. My son liked this and he is the picky one. I used diced tomato with jalapenos as I didn't have any jalapenos on hand."}, {"name": "Cecilia Martinez Guerra", "rating": 5, "body": "Thank you so much for your recipe. I like lengua. They make the best tacos. Also, you can slice the meat after it is cooked and skin removed and fry in a little oil with slice onions, and chopped tomatoes, minced fresh garlic, salt and pepper. Serve with mexican rice and pinto beans. and of course flour or corn tortillas. You can also add 1 hot serrano chopped into tomato and onion mixture. thanks again for a great recipe"}, {"name": "s.arias", "rating": 5, "body": "very well exsplained"}, {"name": "Jorlan2000", "rating": 5, "body": "It certainly took a long time to brine, but this was an excellent recipe and we all loved it! It's so tender! The only change I made was to decrease it to 2 jalapenos so the kids would eat it."}, {"name": "indycab", "rating": 5, "body": "This was the tastiest lengua I've ever made! Everyone in the family loves the taste!"}, {"name": "C Kronenberg", "rating": 5, "body": "It was my families first time with lengua and we are impressed. This recipe probably has a lot to do with our liking it. I used chilli peppers in place of jalapenos because the kids can tolerate it a lot better. We turned into tacos as well, with my husbands homemade salsa with tomatoes, jalapenos, cilantro, onions, lemon juice and garlic powder. I even chased the kids with the tongue before cooking, and they still liked eating it!!"}, {"name": "teddybear", "rating": 5, "body": "My husband loves Lengua. We are currently in Hanoi Vietnam and I though why not while we are here to try this dish. I was about to get FRESH beef tongue which I think made the dish good. Instead of cooking the tomatoes, jalapenos separte I cooked it with the tongue and I added 1 cup of chicken broth. He said it was just like the kind he would get in his favorite restuarant in Texas. I have friends here now wanting the recipe. This is a keeper. :)"}, {"name": "Paul Page", "rating": 4, "body": "Excellent recipe but for those that don't like the heat cut back to one jalopeno."}, {"name": "Sherbear1", "rating": 5, "body": "This is a great recipe, I followed it exactly and it tunred out wonderful! My DH ate it all up. We made tacos, and topped them with cilantro, onion, limes, and hotsauce. Then with the left overs took sandwiches the next day. Thanks for the great recipe!!"}, {"name": "Julius Lagman", "rating": 5, "body": "This is a tasty recipe. Try adjusting the cooking time and substituting with smoked tongue instead. Or better yet, apple wood smoke the tongue yourself. Simply delicious. Added a little fresh thyme, bay leaf, when cooking the tongue. Served the dish over rice, but I expect it would also be good with a side of boiled potatoes or over french fries."}], "aggregateRating": {"ratingValue": "4.5", "ratingCount": 24}, "nutrition": {"calories": 201, "carbohydrate": 2, "cholesterol": 82, "fiber": 1, "protein": 12, "saturatedFat": 5, "sodium": 1350, "sugar": 1, "fat": 16, "unsaturatedFat": 0}}
]